; ModuleID = 'send_connect.bc'
source_filename = "send_connect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.mosquitto = type { i32, i32, i32, i32, i8*, i8*, i8*, i8*, i16, i16, i32, i64, i64, i64, %struct.mosquitto__packet, %struct.mosquitto__packet*, %struct.mosquitto__packet*, %struct.mosquitto_message_all*, %struct.mosquitto__alias*, %struct.will_delay_list*, i32, i32, i32, i64, i8, i8, i8, i32, i64, i8*, i8, %struct.mosquitto_msg_data, %struct.mosquitto_msg_data, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, i32)*, void (%struct.mosquitto*, i8*, i32, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, %struct.mosquitto_message*)*, void (%struct.mosquitto*, i8*, %struct.mosquitto_message*, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32, i32, i32*)*, void (%struct.mosquitto*, i8*, i32, i32, i32*, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32, i8*)*, i8*, i32, i8*, i32, i32, i32, i8, i8, %struct.mosquitto__packet*, i8, i32 }

!79 = !DIEnumerator(name: "MOSQ_ERR_QOS_NOT_SUPPORTED", value: 24)
!80 = !DIEnumerator(name: "MOSQ_ERR_OVERSIZE_PACKET", value: 25)
!81 = !DIEnumerator(name: "MOSQ_ERR_OCSP", value: 26)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_property", file: !83, line: 108, size: 32, elements: !84)
!83 = !DIFile(filename: "./mqtt_protocol.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!85 = !DIEnumerator(name: "MQTT_PROP_PAYLOAD_FORMAT_INDICATOR", value: 1)
!86 = !DIEnumerator(name: "MQTT_PROP_MESSAGE_EXPIRY_INTERVAL", value: 2)
!87 = !DIEnumerator(name: "MQTT_PROP_CONTENT_TYPE", value: 3)
!88 = !DIEnumerator(name: "MQTT_PROP_RESPONSE_TOPIC", value: 8)
!89 = !DIEnumerator(name: "MQTT_PROP_CORRELATION_DATA", value: 9)
!90 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_IDENTIFIER", value: 11)
!91 = !DIEnumerator(name: "MQTT_PROP_SESSION_EXPIRY_INTERVAL", value: 17)
!92 = !DIEnumerator(name: "MQTT_PROP_ASSIGNED_CLIENT_IDENTIFIER", value: 18)
!93 = !DIEnumerator(name: "MQTT_PROP_SERVER_KEEP_ALIVE", value: 19)
!94 = !DIEnumerator(name: "MQTT_PROP_AUTHENTICATION_METHOD", value: 21)
!95 = !DIEnumerator(name: "MQTT_PROP_AUTHENTICATION_DATA", value: 22)
!96 = !DIEnumerator(name: "MQTT_PROP_REQUEST_PROBLEM_INFORMATION", value: 23)
!97 = !DIEnumerator(name: "MQTT_PROP_WILL_DELAY_INTERVAL", value: 24)
!98 = !DIEnumerator(name: "MQTT_PROP_REQUEST_RESPONSE_INFORMATION", value: 25)
!99 = !DIEnumerator(name: "MQTT_PROP_RESPONSE_INFORMATION", value: 26)
!100 = !DIEnumerator(name: "MQTT_PROP_SERVER_REFERENCE", value: 28)
!101 = !DIEnumerator(name: "MQTT_PROP_REASON_STRING", value: 31)
!102 = !DIEnumerator(name: "MQTT_PROP_RECEIVE_MAXIMUM", value: 33)
!103 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS_MAXIMUM", value: 34)
!104 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS", value: 35)
!105 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_QOS", value: 36)
!106 = !DIEnumerator(name: "MQTT_PROP_RETAIN_AVAILABLE", value: 37)
!107 = !DIEnumerator(name: "MQTT_PROP_USER_PROPERTY", value: 38)
!108 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_PACKET_SIZE", value: 39)
!109 = !DIEnumerator(name: "MQTT_PROP_WILDCARD_SUB_AVAILABLE", value: 40)
!110 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_ID_AVAILABLE", value: 41)
!111 = !DIEnumerator(name: "MQTT_PROP_SHARED_SUB_AVAILABLE", value: 42)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{i32 1, !"wchar_size", i32 4}
!120 = !{i32 7, !"PIC Level", i32 2}
!121 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!122 = distinct !DISubprogram(name: "simple_encrypt", scope: !1, file: !1, line: 37, type: !123, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !126)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !125}
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{}
!127 = !DILocalVariable(name: "val", arg: 1, scope: !122, file: !1, line: 37, type: !125)
!128 = !DILocation(line: 37, column: 24, scope: !122)
!129 = !DILocalVariable(name: "key", scope: !122, file: !1, line: 38, type: !125)
!130 = !DILocation(line: 38, column: 6, scope: !122)
!131 = !DILocalVariable(name: "encrypted", scope: !122, file: !1, line: 40, type: !125)
!132 = !DILocation(line: 40, column: 6, scope: !122)
!133 = !DILocation(line: 40, column: 18, scope: !122)
!134 = !DILocation(line: 40, column: 24, scope: !122)
!135 = !DILocation(line: 40, column: 22, scope: !122)
!136 = !DILocation(line: 42, column: 9, scope: !122)
!137 = !DILocation(line: 42, column: 2, scope: !122)
!138 = distinct !DISubprogram(name: "change_static_value", scope: !1, file: !1, line: 46, type: !123, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !126)
!139 = !DILocalVariable(name: "static_value", arg: 1, scope: !138, file: !1, line: 46, type: !125)
!140 = !DILocation(line: 46, column: 29, scope: !138)
!141 = !DILocalVariable(name: "nonce", scope: !138, file: !1, line: 47, type: !142)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 4)
!145 = !DILocation(line: 47, column: 6, scope: !138)
!146 = !DILocalVariable(name: "rawtime", scope: !138, file: !1, line: 48, type: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !148, line: 7, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !150, line: 148, baseType: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!151 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!152 = !DILocation(line: 48, column: 9, scope: !138)
!153 = !DILocalVariable(name: "ptm", scope: !138, file: !1, line: 49, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !156, line: 7, size: 448, elements: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !155, file: !156, line: 9, baseType: !125, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !155, file: !156, line: 10, baseType: !125, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !155, file: !156, line: 11, baseType: !125, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !155, file: !156, line: 12, baseType: !125, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !155, file: !156, line: 13, baseType: !125, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !155, file: !156, line: 14, baseType: !125, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !155, file: !156, line: 15, baseType: !125, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !155, file: !156, line: 16, baseType: !125, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !155, file: !156, line: 17, baseType: !125, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !155, file: !156, line: 20, baseType: !151, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !155, file: !156, line: 21, baseType: !114, size: 64, offset: 384)
!169 = !DILocation(line: 49, column: 17, scope: !138)
!170 = !DILocation(line: 50, column: 2, scope: !138)
!171 = !DILocation(line: 51, column: 8, scope: !138)
!172 = !DILocation(line: 51, column: 6, scope: !138)
!173 = !DILocation(line: 53, column: 7, scope: !174)
!174 = distinct !DILexicalBlock(scope: !138, file: !1, line: 53, column: 6)
!175 = !DILocation(line: 53, column: 12, scope: !174)
!176 = !DILocation(line: 53, column: 20, scope: !174)
!177 = !DILocation(line: 53, column: 24, scope: !174)
!178 = !DILocation(line: 53, column: 6, scope: !138)
!179 = !DILocation(line: 54, column: 18, scope: !180)
!180 = distinct !DILexicalBlock(scope: !174, file: !1, line: 53, column: 30)
!181 = !DILocation(line: 54, column: 30, scope: !180)
!182 = !DILocation(line: 54, column: 35, scope: !180)
!183 = !DILocation(line: 54, column: 33, scope: !180)
!184 = !DILocation(line: 54, column: 16, scope: !180)
!185 = !DILocation(line: 55, column: 2, scope: !180)
!186 = !DILocation(line: 56, column: 18, scope: !187)
!187 = distinct !DILexicalBlock(scope: !174, file: !1, line: 55, column: 9)
!188 = !DILocation(line: 56, column: 30, scope: !187)
!189 = !DILocation(line: 56, column: 35, scope: !187)
!190 = !DILocation(line: 56, column: 33, scope: !187)
!191 = !DILocation(line: 56, column: 16, scope: !187)
!192 = !DILocation(line: 58, column: 9, scope: !138)
!193 = !DILocation(line: 58, column: 2, scope: !138)
!194 = distinct !DISubprogram(name: "send__connect", scope: !1, file: !1, line: 61, type: !195, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !126)
!195 = !DISubroutineType(types: !196)
!196 = !{!125, !197, !211, !279, !337}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto", file: !4, line: 207, size: 3456, elements: !199)
!199 = !{!200, !202, !203, !204, !205, !207, !208, !209, !210, !215, !216, !217, !218, !219, !220, !245, !246, !247, !293, !299, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !324, !325, !329, !333, !339, !340, !344, !345, !346, !352, !356, !362, !366, !367, !368, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !198, file: !4, line: 208, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosq_sock_t", file: !4, line: 70, baseType: !125)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sockpairR", scope: !198, file: !4, line: 210, baseType: !201, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sockpairW", scope: !198, file: !4, line: 210, baseType: !201, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !198, file: !4, line: 215, baseType: !3, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !198, file: !4, line: 216, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !4, line: 217, baseType: !206, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !198, file: !4, line: 218, baseType: !206, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !198, file: !4, line: 219, baseType: !206, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !198, file: !4, line: 220, baseType: !211, size: 16, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !212, line: 25, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !150, line: 39, baseType: !214)
!214 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "last_mid", scope: !198, file: !4, line: 221, baseType: !211, size: 16, offset: 400)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !198, file: !4, line: 222, baseType: !11, size: 32, offset: 416)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_msg_in", scope: !198, file: !4, line: 223, baseType: !147, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next_msg_out", scope: !198, file: !4, line: 224, baseType: !147, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ping_t", scope: !198, file: !4, line: 225, baseType: !147, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "in_packet", scope: !198, file: !4, line: 226, baseType: !221, size: 320, offset: 640)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__packet", file: !4, line: 150, size: 320, elements: !222)
!222 = !{!223, !228, !230, !234, !235, !236, !237, !238, !239, !240}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !221, file: !4, line: 151, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !212, line: 24, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !150, line: 37, baseType: !227)
!227 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !4, line: 152, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_mult", scope: !221, file: !4, line: 153, baseType: !231, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !212, line: 26, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !150, line: 41, baseType: !233)
!233 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_length", scope: !221, file: !4, line: 154, baseType: !231, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !221, file: !4, line: 155, baseType: !231, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "to_process", scope: !221, file: !4, line: 156, baseType: !231, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !221, file: !4, line: 157, baseType: !231, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !221, file: !4, line: 158, baseType: !211, size: 16, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !221, file: !4, line: 159, baseType: !225, size: 8, offset: 304)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_count", scope: !221, file: !4, line: 160, baseType: !241, size: 8, offset: 312)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !242, line: 24, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !150, line: 36, baseType: !244)
!244 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "current_out_packet", scope: !198, file: !4, line: 227, baseType: !229, size: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet", scope: !198, file: !4, line: 228, baseType: !229, size: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "will", scope: !198, file: !4, line: 229, baseType: !248, size: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message_all", file: !4, line: 163, size: 704, elements: !250)
!250 = !{!251, !252, !253, !280, !281, !282, !283, !292}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !4, line: 164, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !249, file: !4, line: 165, baseType: !248, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !249, file: !4, line: 166, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto_property", file: !49, line: 135, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt5__property", file: !257, line: 27, size: 384, elements: !258)
!257 = !DIFile(filename: "./property_mosq.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/lib")
!258 = !{!259, !261, !274, !275, !278}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !257, line: 28, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !257, line: 36, baseType: !262, size: 128, offset: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !257, line: 29, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !273}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i8", scope: !262, file: !257, line: 30, baseType: !225, size: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i16", scope: !262, file: !257, line: 31, baseType: !211, size: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !262, file: !257, line: 32, baseType: !231, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "varint", scope: !262, file: !257, line: 33, baseType: !231, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !262, file: !257, line: 34, baseType: !269, size: 128)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt__string", file: !257, line: 22, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !269, file: !257, line: 23, baseType: !206, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !257, line: 24, baseType: !125, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !262, file: !257, line: 35, baseType: !269, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !257, line: 37, baseType: !269, size: 128, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !256, file: !257, line: 38, baseType: !276, size: 32, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !242, line: 26, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !150, line: 40, baseType: !125)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "client_generated", scope: !256, file: !257, line: 39, baseType: !279, size: 8, offset: 352)
!279 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !249, file: !4, line: 167, baseType: !147, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !249, file: !4, line: 169, baseType: !34, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !249, file: !4, line: 170, baseType: !279, size: 8, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !249, file: !4, line: 171, baseType: !284, size: 320, offset: 320)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message", file: !49, line: 125, size: 320, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !284, file: !49, line: 126, baseType: !125, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !284, file: !49, line: 127, baseType: !206, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !284, file: !49, line: 128, baseType: !113, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !284, file: !49, line: 129, baseType: !125, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !284, file: !49, line: 130, baseType: !125, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !284, file: !49, line: 131, baseType: !279, size: 8, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_interval", scope: !249, file: !4, line: 172, baseType: !231, size: 32, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !198, file: !4, line: 230, baseType: !294, size: 64, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__alias", file: !4, line: 139, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !295, file: !4, line: 140, baseType: !206, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !295, file: !4, line: 141, baseType: !211, size: 16, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_entry", scope: !198, file: !4, line: 231, baseType: !300, size: 64, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "will_delay_list", file: !4, line: 182, size: 192, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !301, file: !4, line: 183, baseType: !197, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !4, line: 184, baseType: !300, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !4, line: 185, baseType: !300, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_packet_size", scope: !198, file: !4, line: 232, baseType: !231, size: 32, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "alias_count", scope: !198, file: !4, line: 233, baseType: !125, size: 32, offset: 1312)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_interval", scope: !198, file: !4, line: 234, baseType: !231, size: 32, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_time", scope: !198, file: !4, line: 235, baseType: !147, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "want_write", scope: !198, file: !4, line: 257, baseType: !279, size: 8, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "want_connect", scope: !198, file: !4, line: 258, baseType: !279, size: 8, offset: 1480)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "clean_start", scope: !198, file: !4, line: 269, baseType: !279, size: 8, offset: 1488)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_interval", scope: !198, file: !4, line: 270, baseType: !231, size: 32, offset: 1504)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_time", scope: !198, file: !4, line: 271, baseType: !147, size: 64, offset: 1536)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !198, file: !4, line: 305, baseType: !113, size: 64, offset: 1600)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "in_callback", scope: !198, file: !4, line: 306, baseType: !279, size: 8, offset: 1664)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_in", scope: !198, file: !4, line: 307, baseType: !318, size: 192, offset: 1728)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_data", file: !4, line: 188, size: 192, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "inflight", scope: !318, file: !4, line: 197, baseType: !248, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "queue_len", scope: !318, file: !4, line: 198, baseType: !125, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_quota", scope: !318, file: !4, line: 203, baseType: !125, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_maximum", scope: !318, file: !4, line: 204, baseType: !211, size: 16, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_out", scope: !198, file: !4, line: 308, baseType: !318, size: 192, offset: 1920)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "on_connect", scope: !198, file: !4, line: 309, baseType: !326, size: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !197, !113, !125}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "on_connect_with_flags", scope: !198, file: !4, line: 310, baseType: !330, size: 64, offset: 2176)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !197, !113, !125, !125}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "on_connect_v5", scope: !198, file: !4, line: 311, baseType: !334, size: 64, offset: 2240)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !197, !113, !125, !125, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "on_disconnect", scope: !198, file: !4, line: 312, baseType: !326, size: 64, offset: 2304)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "on_disconnect_v5", scope: !198, file: !4, line: 313, baseType: !341, size: 64, offset: 2368)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !197, !113, !125, !337}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "on_publish", scope: !198, file: !4, line: 314, baseType: !326, size: 64, offset: 2432)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "on_publish_v5", scope: !198, file: !4, line: 315, baseType: !334, size: 64, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !198, file: !4, line: 316, baseType: !347, size: 64, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !197, !113, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "on_message_v5", scope: !198, file: !4, line: 317, baseType: !353, size: 64, offset: 2624)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !197, !113, !350, !337}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "on_subscribe", scope: !198, file: !4, line: 318, baseType: !357, size: 64, offset: 2688)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !197, !113, !125, !125, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "on_subscribe_v5", scope: !198, file: !4, line: 319, baseType: !363, size: 64, offset: 2752)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !197, !113, !125, !125, !360, !337}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "on_unsubscribe", scope: !198, file: !4, line: 320, baseType: !326, size: 64, offset: 2816)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "on_unsubscribe_v5", scope: !198, file: !4, line: 321, baseType: !341, size: 64, offset: 2880)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "on_log", scope: !198, file: !4, line: 322, baseType: !369, size: 64, offset: 2944)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !197, !113, !125, !114}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !198, file: !4, line: 324, baseType: !206, size: 64, offset: 3008)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !198, file: !4, line: 325, baseType: !125, size: 32, offset: 3072)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bind_address", scope: !198, file: !4, line: 326, baseType: !206, size: 64, offset: 3136)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reconnects", scope: !198, file: !4, line: 327, baseType: !233, size: 32, offset: 3200)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_delay", scope: !198, file: !4, line: 328, baseType: !233, size: 32, offset: 3232)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_delay_max", scope: !198, file: !4, line: 329, baseType: !233, size: 32, offset: 3264)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_exponential_backoff", scope: !198, file: !4, line: 330, baseType: !279, size: 8, offset: 3296)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "threaded", scope: !198, file: !4, line: 331, baseType: !116, size: 8, offset: 3304)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet_last", scope: !198, file: !4, line: 332, baseType: !229, size: 64, offset: 3328)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_qos", scope: !198, file: !4, line: 337, baseType: !225, size: 8, offset: 3392)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !198, file: !4, line: 348, baseType: !125, size: 32, offset: 3424)
!383 = !DILocalVariable(name: "mosq", arg: 1, scope: !194, file: !1, line: 61, type: !197)
!384 = !DILocation(line: 61, column: 37, scope: !194)
!385 = !DILocalVariable(name: "keepalive", arg: 2, scope: !194, file: !1, line: 61, type: !211)
!386 = !DILocation(line: 61, column: 52, scope: !194)
!387 = !DILocalVariable(name: "clean_session", arg: 3, scope: !194, file: !1, line: 61, type: !279)
!388 = !DILocation(line: 61, column: 68, scope: !194)
!389 = !DILocalVariable(name: "properties", arg: 4, scope: !194, file: !1, line: 61, type: !337)
!390 = !DILocation(line: 61, column: 109, scope: !194)
!391 = !DILocalVariable(name: "packet", scope: !194, file: !1, line: 64, type: !229)
!392 = !DILocation(line: 64, column: 28, scope: !194)
!393 = !DILocalVariable(name: "payloadlen", scope: !194, file: !1, line: 65, type: !125)
!394 = !DILocation(line: 65, column: 6, scope: !194)
!395 = !DILocalVariable(name: "will", scope: !194, file: !1, line: 66, type: !225)
!396 = !DILocation(line: 66, column: 10, scope: !194)
!397 = !DILocalVariable(name: "byte", scope: !194, file: !1, line: 67, type: !225)
!398 = !DILocation(line: 67, column: 10, scope: !194)
!399 = !DILocalVariable(name: "rc", scope: !194, file: !1, line: 68, type: !125)
!400 = !DILocation(line: 68, column: 6, scope: !194)
!401 = !DILocalVariable(name: "version", scope: !194, file: !1, line: 69, type: !225)
!402 = !DILocation(line: 69, column: 10, scope: !194)
!403 = !DILocalVariable(name: "clientid", scope: !194, file: !1, line: 70, type: !206)
!404 = !DILocation(line: 70, column: 8, scope: !194)
!405 = !DILocalVariable(name: "username", scope: !194, file: !1, line: 70, type: !206)
!406 = !DILocation(line: 70, column: 19, scope: !194)
!407 = !DILocalVariable(name: "password", scope: !194, file: !1, line: 70, type: !206)
!408 = !DILocation(line: 70, column: 30, scope: !194)
!409 = !DILocalVariable(name: "headerlen", scope: !194, file: !1, line: 71, type: !125)
!410 = !DILocation(line: 71, column: 6, scope: !194)
!411 = !DILocalVariable(name: "proplen", scope: !194, file: !1, line: 72, type: !125)
!412 = !DILocation(line: 72, column: 6, scope: !194)
!413 = !DILocalVariable(name: "will_proplen", scope: !194, file: !1, line: 72, type: !125)
!414 = !DILocation(line: 72, column: 19, scope: !194)
!415 = !DILocalVariable(name: "varbytes", scope: !194, file: !1, line: 72, type: !125)
!416 = !DILocation(line: 72, column: 33, scope: !194)
!417 = !DILocalVariable(name: "local_props", scope: !194, file: !1, line: 73, type: !254)
!418 = !DILocation(line: 73, column: 22, scope: !194)
!419 = !DILocalVariable(name: "receive_maximum", scope: !194, file: !1, line: 74, type: !211)
!420 = !DILocation(line: 74, column: 11, scope: !194)
!421 = !DILocation(line: 76, column: 2, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !1, line: 76, column: 2)
!423 = distinct !DILexicalBlock(scope: !194, file: !1, line: 76, column: 2)
!424 = !DILocation(line: 76, column: 2, scope: !423)
!425 = !DILocation(line: 78, column: 5, scope: !426)
!426 = distinct !DILexicalBlock(scope: !194, file: !1, line: 78, column: 5)
!427 = !DILocation(line: 78, column: 11, scope: !426)
!428 = !DILocation(line: 78, column: 20, scope: !426)
!429 = !DILocation(line: 78, column: 37, scope: !426)
!430 = !DILocation(line: 78, column: 41, scope: !426)
!431 = !DILocation(line: 78, column: 47, scope: !426)
!432 = !DILocation(line: 78, column: 5, scope: !194)
!433 = !DILocation(line: 78, column: 51, scope: !426)
!434 = !DILocation(line: 91, column: 13, scope: !194)
!435 = !DILocation(line: 91, column: 19, scope: !194)
!436 = !DILocation(line: 91, column: 11, scope: !194)
!437 = !DILocation(line: 92, column: 13, scope: !194)
!438 = !DILocation(line: 92, column: 19, scope: !194)
!439 = !DILocation(line: 92, column: 11, scope: !194)
!440 = !DILocation(line: 93, column: 13, scope: !194)
