; ModuleID = 'handle_connect.bc'
source_filename = "handle_connect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mosquitto_db = type { i64, %struct.mosquitto__subhier*, %struct.mosquitto__unpwd*, %struct.mosquitto__unpwd*, %struct.mosquitto*, %struct.mosquitto*, %struct.mosquitto*, %struct.clientid__index_hash*, %struct.mosquitto_msg_store*, %struct.mosquitto_msg_store_load*, i32, i64, i8*, %struct.mosquitto__config*, i32, i8, i32, %struct.mosquitto* }
%struct.mosquitto__subhier = type { %struct.UT_hash_handle, %struct.mosquitto__subhier*, %struct.mosquitto__subhier*, %struct.mosquitto__subleaf*, %struct.mosquitto__subshared*, %struct.mosquitto_msg_store*, i8*, i16 }
%struct.UT_hash_handle = type { %struct.UT_hash_table*, i8*, i8*, %struct.UT_hash_handle*, %struct.UT_hash_handle*, i8*, i32, i32 }
%struct.UT_hash_table = type { %struct.UT_hash_bucket*, i32, i32, i32, %struct.UT_hash_handle*, i64, i32, i32, i32, i32, i32 }
%struct.UT_hash_bucket = type { %struct.UT_hash_handle*, i32, i32 }
%struct.mosquitto__subleaf = type { %struct.mosquitto__subleaf*, %struct.mosquitto__subleaf*, %struct.mosquitto*, i32, i8, i8, i8 }
%struct.mosquitto__subshared = type { %struct.UT_hash_handle, i8*, %struct.mosquitto__subleaf* }
%struct.mosquitto__unpwd = type { i8*, i8*, %struct.UT_hash_handle }
%struct.clientid__index_hash = type opaque

!124 = !DIEnumerator(name: "MQTT_PROP_RECEIVE_MAXIMUM", value: 33)
!125 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS_MAXIMUM", value: 34)
!126 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS", value: 35)
!127 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_QOS", value: 36)
!128 = !DIEnumerator(name: "MQTT_PROP_RETAIN_AVAILABLE", value: 37)
!129 = !DIEnumerator(name: "MQTT_PROP_USER_PROPERTY", value: 38)
!130 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_PACKET_SIZE", value: 39)
!131 = !DIEnumerator(name: "MQTT_PROP_WILDCARD_SUB_AVAILABLE", value: 40)
!132 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_ID_AVAILABLE", value: 41)
!133 = !DIEnumerator(name: "MQTT_PROP_SHARED_SUB_AVAILABLE", value: 42)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt311_connack_codes", file: !105, line: 49, size: 32, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141}
!136 = !DIEnumerator(name: "CONNACK_ACCEPTED", value: 0)
!137 = !DIEnumerator(name: "CONNACK_REFUSED_PROTOCOL_VERSION", value: 1)
!138 = !DIEnumerator(name: "CONNACK_REFUSED_IDENTIFIER_REJECTED", value: 2)
!139 = !DIEnumerator(name: "CONNACK_REFUSED_SERVER_UNAVAILABLE", value: 3)
!140 = !DIEnumerator(name: "CONNACK_REFUSED_BAD_USERNAME_PASSWORD", value: 4)
!141 = !DIEnumerator(name: "CONNACK_REFUSED_NOT_AUTHORIZED", value: 5)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_return_codes", file: !105, line: 59, size: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!144 = !DIEnumerator(name: "MQTT_RC_SUCCESS", value: 0)
!145 = !DIEnumerator(name: "MQTT_RC_NORMAL_DISCONNECTION", value: 0)
!146 = !DIEnumerator(name: "MQTT_RC_GRANTED_QOS0", value: 0)
!147 = !DIEnumerator(name: "MQTT_RC_GRANTED_QOS1", value: 1)
!148 = !DIEnumerator(name: "MQTT_RC_GRANTED_QOS2", value: 2)
!149 = !DIEnumerator(name: "MQTT_RC_DISCONNECT_WITH_WILL_MSG", value: 4)
!150 = !DIEnumerator(name: "MQTT_RC_NO_MATCHING_SUBSCRIBERS", value: 16)
!151 = !DIEnumerator(name: "MQTT_RC_NO_SUBSCRIPTION_EXISTED", value: 17)
!152 = !DIEnumerator(name: "MQTT_RC_CONTINUE_AUTHENTICATION", value: 24)
!153 = !DIEnumerator(name: "MQTT_RC_REAUTHENTICATE", value: 25)
!154 = !DIEnumerator(name: "MQTT_RC_UNSPECIFIED", value: 128)
!155 = !DIEnumerator(name: "MQTT_RC_MALFORMED_PACKET", value: 129)
!156 = !DIEnumerator(name: "MQTT_RC_PROTOCOL_ERROR", value: 130)
!157 = !DIEnumerator(name: "MQTT_RC_IMPLEMENTATION_SPECIFIC", value: 131)
!158 = !DIEnumerator(name: "MQTT_RC_UNSUPPORTED_PROTOCOL_VERSION", value: 132)
!159 = !DIEnumerator(name: "MQTT_RC_CLIENTID_NOT_VALID", value: 133)
!160 = !DIEnumerator(name: "MQTT_RC_BAD_USERNAME_OR_PASSWORD", value: 134)
!161 = !DIEnumerator(name: "MQTT_RC_NOT_AUTHORIZED", value: 135)
!162 = !DIEnumerator(name: "MQTT_RC_SERVER_UNAVAILABLE", value: 136)
!163 = !DIEnumerator(name: "MQTT_RC_SERVER_BUSY", value: 137)
!164 = !DIEnumerator(name: "MQTT_RC_BANNED", value: 138)
!165 = !DIEnumerator(name: "MQTT_RC_SERVER_SHUTTING_DOWN", value: 139)
!166 = !DIEnumerator(name: "MQTT_RC_BAD_AUTHENTICATION_METHOD", value: 140)
!167 = !DIEnumerator(name: "MQTT_RC_KEEP_ALIVE_TIMEOUT", value: 141)
!168 = !DIEnumerator(name: "MQTT_RC_SESSION_TAKEN_OVER", value: 142)
!169 = !DIEnumerator(name: "MQTT_RC_TOPIC_FILTER_INVALID", value: 143)
!170 = !DIEnumerator(name: "MQTT_RC_TOPIC_NAME_INVALID", value: 144)
!171 = !DIEnumerator(name: "MQTT_RC_PACKET_ID_IN_USE", value: 145)
!172 = !DIEnumerator(name: "MQTT_RC_PACKET_ID_NOT_FOUND", value: 146)
!173 = !DIEnumerator(name: "MQTT_RC_RECEIVE_MAXIMUM_EXCEEDED", value: 147)
!174 = !DIEnumerator(name: "MQTT_RC_TOPIC_ALIAS_INVALID", value: 148)
!175 = !DIEnumerator(name: "MQTT_RC_PACKET_TOO_LARGE", value: 149)
!176 = !DIEnumerator(name: "MQTT_RC_MESSAGE_RATE_TOO_HIGH", value: 150)
!177 = !DIEnumerator(name: "MQTT_RC_QUOTA_EXCEEDED", value: 151)
!178 = !DIEnumerator(name: "MQTT_RC_ADMINISTRATIVE_ACTION", value: 152)
!179 = !DIEnumerator(name: "MQTT_RC_PAYLOAD_FORMAT_INVALID", value: 153)
!180 = !DIEnumerator(name: "MQTT_RC_RETAIN_NOT_SUPPORTED", value: 154)
!181 = !DIEnumerator(name: "MQTT_RC_QOS_NOT_SUPPORTED", value: 155)
!182 = !DIEnumerator(name: "MQTT_RC_USE_ANOTHER_SERVER", value: 156)
!183 = !DIEnumerator(name: "MQTT_RC_SERVER_MOVED", value: 157)
!184 = !DIEnumerator(name: "MQTT_RC_SHARED_SUBS_NOT_SUPPORTED", value: 158)
!185 = !DIEnumerator(name: "MQTT_RC_CONNECTION_RATE_EXCEEDED", value: 159)
!186 = !DIEnumerator(name: "MQTT_RC_MAXIMUM_CONNECT_TIME", value: 160)
!187 = !DIEnumerator(name: "MQTT_RC_SUBSCRIPTION_IDS_NOT_SUPPORTED", value: 161)
!188 = !DIEnumerator(name: "MQTT_RC_WILDCARD_SUBS_NOT_SUPPORTED", value: 162)
!189 = !{!190, !191, !193, !194, !202, !219, !720, !597, !722}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto", file: !4, line: 207, size: 4032, elements: !196)
!196 = !{!197, !200, !201, !204, !205, !206, !207, !213, !214, !215, !220, !221, !222, !245, !246, !247, !293, !299, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !371, !662, !663, !664, !665, !666, !695, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !719}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !195, file: !4, line: 208, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosq_sock_t", file: !4, line: 70, baseType: !199)
!199 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !195, file: !4, line: 215, baseType: !3, size: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !195, file: !4, line: 216, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !195, file: !4, line: 217, baseType: !202, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !195, file: !4, line: 218, baseType: !202, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !195, file: !4, line: 219, baseType: !202, size: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !195, file: !4, line: 220, baseType: !208, size: 16, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !209, line: 25, baseType: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !211, line: 39, baseType: !212)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!212 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "last_mid", scope: !195, file: !4, line: 221, baseType: !208, size: 16, offset: 336)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !4, line: 222, baseType: !11, size: 32, offset: 352)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "last_msg_in", scope: !195, file: !4, line: 223, baseType: !216, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !217, line: 7, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !211, line: 148, baseType: !219)
!219 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next_msg_out", scope: !195, file: !4, line: 224, baseType: !216, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ping_t", scope: !195, file: !4, line: 225, baseType: !216, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "in_packet", scope: !195, file: !4, line: 226, baseType: !223, size: 320, offset: 576)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__packet", file: !4, line: 150, size: 320, elements: !224)
!224 = !{!225, !229, !231, !234, !235, !236, !237, !238, !239, !240}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !223, file: !4, line: 151, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !209, line: 24, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !211, line: 37, baseType: !192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !4, line: 152, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_mult", scope: !223, file: !4, line: 153, baseType: !232, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !209, line: 26, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !211, line: 41, baseType: !193)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_length", scope: !223, file: !4, line: 154, baseType: !232, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !223, file: !4, line: 155, baseType: !232, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "to_process", scope: !223, file: !4, line: 156, baseType: !232, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !223, file: !4, line: 157, baseType: !232, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !223, file: !4, line: 158, baseType: !208, size: 16, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !223, file: !4, line: 159, baseType: !227, size: 8, offset: 304)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_count", scope: !223, file: !4, line: 160, baseType: !241, size: 8, offset: 312)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !242, line: 24, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !211, line: 36, baseType: !244)
!244 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "current_out_packet", scope: !195, file: !4, line: 227, baseType: !230, size: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet", scope: !195, file: !4, line: 228, baseType: !230, size: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "will", scope: !195, file: !4, line: 229, baseType: !248, size: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message_all", file: !4, line: 163, size: 704, elements: !250)
!250 = !{!251, !252, !253, !280, !281, !282, !283, !292}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !4, line: 164, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !249, file: !4, line: 165, baseType: !248, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !249, file: !4, line: 166, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto_property", file: !71, line: 135, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt5__property", file: !257, line: 27, size: 384, elements: !258)
!257 = !DIFile(filename: "../lib/property_mosq.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!258 = !{!259, !261, !274, !275, !278}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !257, line: 28, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !257, line: 36, baseType: !262, size: 128, offset: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !257, line: 29, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !273}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i8", scope: !262, file: !257, line: 30, baseType: !227, size: 8)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i16", scope: !262, file: !257, line: 31, baseType: !208, size: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !262, file: !257, line: 32, baseType: !232, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "varint", scope: !262, file: !257, line: 33, baseType: !232, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !262, file: !257, line: 34, baseType: !269, size: 128)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt__string", file: !257, line: 22, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !269, file: !257, line: 23, baseType: !202, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !257, line: 24, baseType: !199, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !262, file: !257, line: 35, baseType: !269, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !257, line: 37, baseType: !269, size: 128, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !256, file: !257, line: 38, baseType: !276, size: 32, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !242, line: 26, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !211, line: 40, baseType: !199)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "client_generated", scope: !256, file: !257, line: 39, baseType: !279, size: 8, offset: 352)
!279 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !249, file: !4, line: 167, baseType: !216, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !249, file: !4, line: 169, baseType: !34, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !249, file: !4, line: 170, baseType: !279, size: 8, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !249, file: !4, line: 171, baseType: !284, size: 320, offset: 320)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message", file: !71, line: 125, size: 320, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !284, file: !71, line: 126, baseType: !199, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !284, file: !71, line: 127, baseType: !202, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !284, file: !71, line: 128, baseType: !190, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !284, file: !71, line: 129, baseType: !199, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !284, file: !71, line: 130, baseType: !199, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !284, file: !71, line: 131, baseType: !279, size: 8, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_interval", scope: !249, file: !4, line: 172, baseType: !232, size: 32, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !195, file: !4, line: 230, baseType: !294, size: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__alias", file: !4, line: 139, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !295, file: !4, line: 140, baseType: !202, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !295, file: !4, line: 141, baseType: !208, size: 16, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_entry", scope: !195, file: !4, line: 231, baseType: !300, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "will_delay_list", file: !4, line: 182, size: 192, elements: !302)
!302 = !{!303, !304, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !301, file: !4, line: 183, baseType: !194, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !4, line: 184, baseType: !300, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !4, line: 185, baseType: !300, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_packet_size", scope: !195, file: !4, line: 232, baseType: !232, size: 32, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "alias_count", scope: !195, file: !4, line: 233, baseType: !199, size: 32, offset: 1248)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_interval", scope: !195, file: !4, line: 234, baseType: !232, size: 32, offset: 1280)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_time", scope: !195, file: !4, line: 235, baseType: !216, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "want_write", scope: !195, file: !4, line: 257, baseType: !279, size: 8, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "want_connect", scope: !195, file: !4, line: 258, baseType: !279, size: 8, offset: 1416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "clean_start", scope: !195, file: !4, line: 269, baseType: !279, size: 8, offset: 1424)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_interval", scope: !195, file: !4, line: 270, baseType: !232, size: 32, offset: 1440)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_time", scope: !195, file: !4, line: 271, baseType: !216, size: 64, offset: 1472)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "removed_from_by_id", scope: !195, file: !4, line: 273, baseType: !279, size: 8, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_dropping", scope: !195, file: !4, line: 274, baseType: !279, size: 8, offset: 1544)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "is_bridge", scope: !195, file: !4, line: 275, baseType: !279, size: 8, offset: 1552)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !195, file: !4, line: 276, baseType: !319, size: 64, offset: 1600)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__bridge", file: !49, line: 484, size: 1344, elements: !321)
!321 = !{!322, !323, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !49, line: 485, baseType: !202, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addresses", scope: !320, file: !49, line: 486, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bridge_address", file: !49, line: 479, size: 128, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !325, file: !49, line: 480, baseType: !202, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !325, file: !49, line: 481, baseType: !199, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cur_address", scope: !320, file: !49, line: 487, baseType: !199, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "address_count", scope: !320, file: !49, line: 488, baseType: !199, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "primary_retry", scope: !320, file: !49, line: 489, baseType: !216, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "primary_retry_sock", scope: !320, file: !49, line: 490, baseType: !198, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "round_robin", scope: !320, file: !49, line: 491, baseType: !279, size: 8, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "try_private", scope: !320, file: !49, line: 492, baseType: !279, size: 8, offset: 296)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "try_private_accepted", scope: !320, file: !49, line: 493, baseType: !279, size: 8, offset: 304)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "clean_start", scope: !320, file: !49, line: 494, baseType: !279, size: 8, offset: 312)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !320, file: !49, line: 495, baseType: !199, size: 32, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "topics", scope: !320, file: !49, line: 496, baseType: !339, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__bridge_topic", file: !49, line: 469, size: 384, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !340, file: !49, line: 470, baseType: !202, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !340, file: !49, line: 471, baseType: !199, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !340, file: !49, line: 472, baseType: !48, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "local_prefix", scope: !340, file: !49, line: 473, baseType: !202, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "remote_prefix", scope: !340, file: !49, line: 474, baseType: !202, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "local_topic", scope: !340, file: !49, line: 475, baseType: !202, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "remote_topic", scope: !340, file: !49, line: 476, baseType: !202, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "topic_count", scope: !320, file: !49, line: 497, baseType: !199, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "topic_remapping", scope: !320, file: !49, line: 498, baseType: !279, size: 8, offset: 480)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !320, file: !49, line: 499, baseType: !3, size: 32, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "restart_t", scope: !320, file: !49, line: 500, baseType: !216, size: 64, offset: 576)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "remote_clientid", scope: !320, file: !49, line: 501, baseType: !202, size: 64, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "remote_username", scope: !320, file: !49, line: 502, baseType: !202, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "remote_password", scope: !320, file: !49, line: 503, baseType: !202, size: 64, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "local_clientid", scope: !320, file: !49, line: 504, baseType: !202, size: 64, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "local_username", scope: !320, file: !49, line: 505, baseType: !202, size: 64, offset: 896)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "local_password", scope: !320, file: !49, line: 506, baseType: !202, size: 64, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "notification_topic", scope: !320, file: !49, line: 507, baseType: !202, size: 64, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "notifications", scope: !320, file: !49, line: 508, baseType: !279, size: 8, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "notifications_local_only", scope: !320, file: !49, line: 509, baseType: !279, size: 8, offset: 1096)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "start_type", scope: !320, file: !49, line: 510, baseType: !54, size: 32, offset: 1120)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !320, file: !49, line: 511, baseType: !199, size: 32, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "restart_timeout", scope: !320, file: !49, line: 512, baseType: !199, size: 32, offset: 1184)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "backoff_base", scope: !320, file: !49, line: 513, baseType: !199, size: 32, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "backoff_cap", scope: !320, file: !49, line: 514, baseType: !199, size: 32, offset: 1248)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !320, file: !49, line: 515, baseType: !199, size: 32, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lazy_reconnect", scope: !320, file: !49, line: 516, baseType: !279, size: 8, offset: 1312)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "attempt_unsubscribe", scope: !320, file: !49, line: 517, baseType: !279, size: 8, offset: 1320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "initial_notification_done", scope: !320, file: !49, line: 518, baseType: !279, size: 8, offset: 1328)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_in", scope: !195, file: !4, line: 277, baseType: !372, size: 384, offset: 1664)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_data", file: !4, line: 188, size: 384, elements: !373)
!373 = !{!374, !655, !656, !657, !658, !659, !660, !661}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "inflight", scope: !372, file: !4, line: 190, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_client_msg", file: !49, line: 382, size: 448, elements: !377)
!377 = !{!378, !379, !380, !647, !648, !649, !650, !651, !652, !653, !654}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !376, file: !49, line: 383, baseType: !375, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !49, line: 384, baseType: !375, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !376, file: !49, line: 385, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_store", file: !49, line: 360, size: 896, elements: !383)
!383 = !{!384, !385, !386, !391, !392, !393, !625, !627, !628, !629, !630, !631, !640, !641, !642, !643, !644, !645, !646}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !382, file: !49, line: 361, baseType: !381, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !382, file: !49, line: 362, baseType: !381, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "db_id", scope: !382, file: !49, line: 363, baseType: !387, size: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "dbid_t", file: !49, line: 135, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !209, line: 27, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !211, line: 44, baseType: !390)
!390 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !382, file: !49, line: 364, baseType: !202, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "source_username", scope: !382, file: !49, line: 365, baseType: !202, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "source_listener", scope: !382, file: !49, line: 366, baseType: !394, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__listener", file: !49, line: 230, size: 1280, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !405, !406, !407, !408, !409, !410, !411, !412, !581, !624}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !395, file: !49, line: 231, baseType: !199, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !395, file: !49, line: 232, baseType: !208, size: 16, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !395, file: !49, line: 233, baseType: !202, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bind_interface", scope: !395, file: !49, line: 234, baseType: !202, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "max_connections", scope: !395, file: !49, line: 235, baseType: !199, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mount_point", scope: !395, file: !49, line: 236, baseType: !202, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "socks", scope: !395, file: !49, line: 237, baseType: !404, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sock_count", scope: !395, file: !49, line: 238, baseType: !199, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "client_count", scope: !395, file: !49, line: 239, baseType: !199, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !395, file: !49, line: 240, baseType: !60, size: 32, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "socket_domain", scope: !395, file: !49, line: 241, baseType: !199, size: 32, offset: 480)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "use_username_as_clientid", scope: !395, file: !49, line: 242, baseType: !279, size: 8, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_qos", scope: !395, file: !49, line: 243, baseType: !227, size: 8, offset: 520)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_topic_alias", scope: !395, file: !49, line: 244, baseType: !208, size: 16, offset: 528)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "security_options", scope: !395, file: !49, line: 268, baseType: !413, size: 576, offset: 576)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__security_options", file: !49, line: 212, size: 576, elements: !414)
!414 = !{!415, !430, !431, !432, !433, !434, !576, !577, !578, !579, !580}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "acl_list", scope: !413, file: !49, line: 217, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__acl_user", file: !49, line: 415, size: 192, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !49, line: 416, baseType: !416, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !417, file: !49, line: 417, baseType: !202, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !417, file: !49, line: 418, baseType: !422, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__acl", file: !49, line: 407, size: 256, elements: !424)
!424 = !{!425, !426, !427, !428, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !423, file: !49, line: 408, baseType: !422, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !423, file: !49, line: 409, baseType: !202, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !423, file: !49, line: 410, baseType: !199, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ucount", scope: !423, file: !49, line: 411, baseType: !199, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ccount", scope: !423, file: !49, line: 412, baseType: !199, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "acl_patterns", scope: !413, file: !49, line: 218, baseType: !422, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "password_file", scope: !413, file: !49, line: 219, baseType: !202, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "psk_file", scope: !413, file: !49, line: 220, baseType: !202, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "acl_file", scope: !413, file: !49, line: 221, baseType: !202, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "auth_plugin_configs", scope: !413, file: !49, line: 222, baseType: !435, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__auth_plugin_config", file: !49, line: 202, size: 1920, elements: !437)
!437 = !{!438, !439, !446, !447, !448}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !436, file: !49, line: 204, baseType: !202, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !436, file: !49, line: 205, baseType: !440, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_opt", file: !442, line: 35, size: 128, elements: !443)
!442 = !DIFile(filename: "./mosquitto_plugin.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !441, file: !442, line: 36, baseType: !202, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !441, file: !442, line: 37, baseType: !202, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "option_count", scope: !436, file: !49, line: 206, baseType: !199, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "deny_special_chars", scope: !436, file: !49, line: 207, baseType: !279, size: 8, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "plugin", scope: !436, file: !49, line: 209, baseType: !449, size: 1728, offset: 192)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__auth_plugin", file: !49, line: 169, size: 1728, elements: !450)
!450 = !{!451, !452, !453, !457, !463, !468, !473, !475, !492, !497, !502, !508, !513, !515, !517, !519, !521, !528, !533, !538, !548, !553, !558, !560, !565, !570, !575}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !449, file: !49, line: 170, baseType: !190, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !449, file: !49, line: 171, baseType: !190, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_version", scope: !449, file: !49, line: 172, baseType: !454, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!199}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_init_v4", scope: !449, file: !49, line: 174, baseType: !458, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_init_v4", file: !49, line: 137, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!199, !462, !440, !199}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_cleanup_v4", scope: !449, file: !49, line: 175, baseType: !464, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_cleanup_v4", file: !49, line: 138, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!199, !190, !440, !199}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "security_init_v4", scope: !449, file: !49, line: 176, baseType: !469, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_init_v4", file: !49, line: 139, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!199, !190, !440, !199, !279}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "security_cleanup_v4", scope: !449, file: !49, line: 177, baseType: !474, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_cleanup_v4", file: !49, line: 140, baseType: !470)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "acl_check_v4", scope: !449, file: !49, line: 178, baseType: !476, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_acl_check_v4", file: !49, line: 141, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!199, !190, !199, !194, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_acl_msg", file: !442, line: 45, size: 256, elements: !482)
!482 = !{!483, !486, !489, !490, !491}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !481, file: !442, line: 46, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !481, file: !442, line: 47, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !481, file: !442, line: 48, baseType: !219, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !481, file: !442, line: 49, baseType: !199, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !481, file: !442, line: 50, baseType: !279, size: 8, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd_check_v4", scope: !449, file: !49, line: 179, baseType: !493, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_unpwd_check_v4", file: !49, line: 142, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!199, !190, !194, !484, !484}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "psk_key_get_v4", scope: !449, file: !49, line: 180, baseType: !498, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_psk_key_get_v4", file: !49, line: 143, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!199, !190, !194, !484, !484, !202, !199}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "auth_start_v4", scope: !449, file: !49, line: 181, baseType: !503, size: 64, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_auth_start_v4", file: !49, line: 144, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!199, !190, !194, !484, !279, !487, !208, !462, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "auth_continue_v4", scope: !449, file: !49, line: 182, baseType: !509, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_auth_continue_v4", file: !49, line: 145, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!199, !190, !194, !484, !487, !208, !462, !507}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_init_v3", scope: !449, file: !49, line: 184, baseType: !514, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_init_v3", file: !49, line: 147, baseType: !459)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_cleanup_v3", scope: !449, file: !49, line: 185, baseType: !516, size: 64, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_cleanup_v3", file: !49, line: 148, baseType: !465)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "security_init_v3", scope: !449, file: !49, line: 186, baseType: !518, size: 64, offset: 896)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_init_v3", file: !49, line: 149, baseType: !470)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "security_cleanup_v3", scope: !449, file: !49, line: 187, baseType: !520, size: 64, offset: 960)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_cleanup_v3", file: !49, line: 150, baseType: !470)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "acl_check_v3", scope: !449, file: !49, line: 188, baseType: !522, size: 64, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_acl_check_v3", file: !49, line: 151, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!199, !190, !199, !526, !480}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd_check_v3", scope: !449, file: !49, line: 189, baseType: !529, size: 64, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_unpwd_check_v3", file: !49, line: 152, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!199, !190, !526, !484, !484}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "psk_key_get_v3", scope: !449, file: !49, line: 190, baseType: !534, size: 64, offset: 1152)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_psk_key_get_v3", file: !49, line: 153, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!199, !190, !526, !484, !484, !202, !199}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_init_v2", scope: !449, file: !49, line: 192, baseType: !539, size: 64, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_init_v2", file: !49, line: 155, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!199, !462, !543, !199}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_auth_opt", file: !442, line: 40, size: 128, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !544, file: !442, line: 41, baseType: !202, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !544, file: !442, line: 42, baseType: !202, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_cleanup_v2", scope: !449, file: !49, line: 193, baseType: !549, size: 64, offset: 1280)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_cleanup_v2", file: !49, line: 156, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!199, !190, !543, !199}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "security_init_v2", scope: !449, file: !49, line: 194, baseType: !554, size: 64, offset: 1344)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_init_v2", file: !49, line: 157, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!199, !190, !543, !199, !279}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "security_cleanup_v2", scope: !449, file: !49, line: 195, baseType: !559, size: 64, offset: 1408)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_cleanup_v2", file: !49, line: 158, baseType: !555)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "acl_check_v2", scope: !449, file: !49, line: 196, baseType: !561, size: 64, offset: 1472)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_acl_check_v2", file: !49, line: 159, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!199, !190, !484, !484, !484, !199}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd_check_v2", scope: !449, file: !49, line: 197, baseType: !566, size: 64, offset: 1536)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_unpwd_check_v2", file: !49, line: 160, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!199, !190, !484, !484}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "psk_key_get_v2", scope: !449, file: !49, line: 198, baseType: !571, size: 64, offset: 1600)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_psk_key_get_v2", file: !49, line: 161, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!199, !190, !484, !484, !202, !199}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !449, file: !49, line: 199, baseType: !199, size: 32, offset: 1664)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "auth_plugin_config_count", scope: !413, file: !49, line: 223, baseType: !199, size: 32, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "allow_anonymous", scope: !413, file: !49, line: 224, baseType: !241, size: 8, offset: 416)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "allow_zero_length_clientid", scope: !413, file: !49, line: 225, baseType: !279, size: 8, offset: 424)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "auto_id_prefix", scope: !413, file: !49, line: 226, baseType: !202, size: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "auto_id_prefix_len", scope: !413, file: !49, line: 227, baseType: !199, size: 32, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd", scope: !395, file: !49, line: 269, baseType: !582, size: 64, offset: 1152)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__unpwd", file: !49, line: 396, size: 576, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !583, file: !49, line: 397, baseType: !202, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !583, file: !49, line: 398, baseType: !202, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !583, file: !49, line: 404, baseType: !588, size: 448, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "UT_hash_handle", file: !589, line: 946, baseType: !590)
!589 = !DIFile(filename: "../src/deps/uthash.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UT_hash_handle", file: !589, line: 937, size: 448, elements: !591)
!591 = !{!592, !617, !618, !619, !620, !621, !622, !623}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tbl", scope: !590, file: !589, line: 938, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UT_hash_table", file: !589, line: 904, size: 512, elements: !595)
!595 = !{!596, !605, !606, !607, !608, !609, !612, !613, !614, !615, !616}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !594, file: !589, line: 905, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "UT_hash_bucket", file: !589, line: 898, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UT_hash_bucket", file: !589, line: 880, size: 128, elements: !600)
!600 = !{!601, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hh_head", scope: !599, file: !589, line: 881, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !599, file: !589, line: 882, baseType: !193, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "expand_mult", scope: !599, file: !589, line: 896, baseType: !193, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !594, file: !589, line: 906, baseType: !193, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "log2_num_buckets", scope: !594, file: !589, line: 906, baseType: !193, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "num_items", scope: !594, file: !589, line: 907, baseType: !193, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !594, file: !589, line: 908, baseType: !602, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hho", scope: !594, file: !589, line: 909, baseType: !610, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !611, line: 51, baseType: !219)
!611 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ideal_chain_maxlen", scope: !594, file: !589, line: 913, baseType: !193, size: 32, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nonideal_items", scope: !594, file: !589, line: 918, baseType: !193, size: 32, offset: 352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ineff_expands", scope: !594, file: !589, line: 926, baseType: !193, size: 32, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "noexpand", scope: !594, file: !589, line: 926, baseType: !193, size: 32, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !594, file: !589, line: 928, baseType: !232, size: 32, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !590, file: !589, line: 939, baseType: !190, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !590, file: !589, line: 940, baseType: !190, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hh_prev", scope: !590, file: !589, line: 941, baseType: !602, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hh_next", scope: !590, file: !589, line: 942, baseType: !602, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !590, file: !589, line: 943, baseType: !190, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !590, file: !589, line: 944, baseType: !193, size: 32, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hashv", scope: !590, file: !589, line: 945, baseType: !193, size: 32, offset: 416)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "psk_id", scope: !395, file: !49, line: 270, baseType: !582, size: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dest_ids", scope: !382, file: !49, line: 367, baseType: !626, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dest_id_count", scope: !382, file: !49, line: 368, baseType: !199, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !382, file: !49, line: 369, baseType: !199, size: 32, offset: 480)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !382, file: !49, line: 370, baseType: !202, size: 64, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !382, file: !49, line: 371, baseType: !254, size: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !382, file: !49, line: 372, baseType: !632, size: 64, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto__payload_uhpa", file: !49, line: 125, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !49, line: 122, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !633, file: !49, line: 123, baseType: !190, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !633, file: !49, line: 124, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 8)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "message_expiry_time", scope: !382, file: !49, line: 373, baseType: !216, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !382, file: !49, line: 374, baseType: !232, size: 32, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "source_mid", scope: !382, file: !49, line: 375, baseType: !208, size: 16, offset: 800)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !382, file: !49, line: 376, baseType: !208, size: 16, offset: 816)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !382, file: !49, line: 377, baseType: !227, size: 8, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !382, file: !49, line: 378, baseType: !279, size: 8, offset: 840)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !382, file: !49, line: 379, baseType: !227, size: 8, offset: 848)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !376, file: !49, line: 386, baseType: !254, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !376, file: !49, line: 387, baseType: !216, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !376, file: !49, line: 388, baseType: !208, size: 16, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !376, file: !49, line: 389, baseType: !227, size: 8, offset: 336)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !376, file: !49, line: 390, baseType: !279, size: 8, offset: 344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !376, file: !49, line: 391, baseType: !66, size: 32, offset: 352)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !376, file: !49, line: 392, baseType: !34, size: 32, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !376, file: !49, line: 393, baseType: !279, size: 8, offset: 416)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !372, file: !4, line: 191, baseType: !375, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "msg_bytes", scope: !372, file: !4, line: 192, baseType: !390, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "msg_bytes12", scope: !372, file: !4, line: 193, baseType: !390, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count", scope: !372, file: !4, line: 194, baseType: !199, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count12", scope: !372, file: !4, line: 195, baseType: !199, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_quota", scope: !372, file: !4, line: 203, baseType: !199, size: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_maximum", scope: !372, file: !4, line: 204, baseType: !208, size: 16, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_out", scope: !195, file: !4, line: 278, baseType: !372, size: 384, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "acl_list", scope: !195, file: !4, line: 279, baseType: !416, size: 64, offset: 2432)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !195, file: !4, line: 280, baseType: !394, size: 64, offset: 2496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet_last", scope: !195, file: !4, line: 281, baseType: !230, size: 64, offset: 2560)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !195, file: !4, line: 282, baseType: !667, size: 64, offset: 2624)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subhier", file: !49, line: 343, size: 896, elements: !670)
!670 = !{!671, !672, !673, !674, !685, !692, !693, !694}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !669, file: !49, line: 344, baseType: !588, size: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !669, file: !49, line: 345, baseType: !668, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !669, file: !49, line: 346, baseType: !668, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !669, file: !49, line: 347, baseType: !675, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subleaf", file: !49, line: 320, size: 256, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !676, file: !49, line: 321, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !49, line: 322, baseType: !675, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !676, file: !49, line: 323, baseType: !194, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !676, file: !49, line: 324, baseType: !232, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !676, file: !49, line: 325, baseType: !227, size: 8, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "no_local", scope: !676, file: !49, line: 326, baseType: !279, size: 8, offset: 232)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "retain_as_published", scope: !676, file: !49, line: 327, baseType: !279, size: 8, offset: 240)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !669, file: !49, line: 348, baseType: !686, size: 64, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subshared", file: !49, line: 337, size: 576, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !687, file: !49, line: 338, baseType: !588, size: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !687, file: !49, line: 339, baseType: !202, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !687, file: !49, line: 340, baseType: !675, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !669, file: !49, line: 349, baseType: !381, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !669, file: !49, line: 350, baseType: !202, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "topic_len", scope: !669, file: !49, line: 351, baseType: !208, size: 16, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "shared_subs", scope: !195, file: !4, line: 283, baseType: !696, size: 64, offset: 2688)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subshared_ref", file: !49, line: 331, size: 128, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hier", scope: !698, file: !49, line: 332, baseType: !668, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !698, file: !49, line: 333, baseType: !686, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "auth_method", scope: !195, file: !4, line: 284, baseType: !202, size: 64, offset: 2752)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sub_count", scope: !195, file: !4, line: 285, baseType: !199, size: 32, offset: 2816)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "shared_sub_count", scope: !195, file: !4, line: 286, baseType: !199, size: 32, offset: 2848)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pollfd_index", scope: !195, file: !4, line: 287, baseType: !199, size: 32, offset: 2880)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ws_want_write", scope: !195, file: !4, line: 296, baseType: !279, size: 8, offset: 2912)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "assigned_id", scope: !195, file: !4, line: 297, baseType: !279, size: 8, offset: 2920)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_qos", scope: !195, file: !4, line: 337, baseType: !227, size: 8, offset: 2928)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "hh_id", scope: !195, file: !4, line: 340, baseType: !588, size: 448, offset: 2944)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "hh_sock", scope: !195, file: !4, line: 341, baseType: !588, size: 448, offset: 3392)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "for_free_next", scope: !195, file: !4, line: 342, baseType: !194, size: 64, offset: 3840)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_list_item", scope: !195, file: !4, line: 343, baseType: !713, size: 64, offset: 3904)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "session_expiry_list", file: !4, line: 144, size: 192, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !714, file: !4, line: 145, baseType: !194, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !714, file: !4, line: 146, baseType: !713, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !4, line: 147, baseType: !713, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !195, file: !4, line: 348, baseType: !199, size: 32, offset: 3968)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "UT_hash_table", file: !589, line: 935, baseType: !594)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!723 = !{i32 2, !"Dwarf Version", i32 4}
!724 = !{i32 2, !"Debug Info Version", i32 3}
!725 = !{i32 1, !"wchar_size", i32 4}
!726 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!727 = distinct !DISubprogram(name: "connection_check_acl", scope: !1, file: !1, line: 87, type: !728, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !851)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !730, !194, !850}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_db", file: !49, line: 421, size: 1088, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !743, !744, !751, !752, !753, !754, !846, !847, !848, !849}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "last_db_id", scope: !731, file: !49, line: 422, baseType: !387, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !731, file: !49, line: 423, baseType: !668, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd", scope: !731, file: !49, line: 424, baseType: !582, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "psk_id", scope: !731, file: !49, line: 425, baseType: !582, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "contexts_by_id", scope: !731, file: !49, line: 426, baseType: !194, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "contexts_by_sock", scope: !731, file: !49, line: 427, baseType: !194, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "contexts_for_free", scope: !731, file: !49, line: 428, baseType: !194, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "clientid_index_hash", scope: !731, file: !49, line: 432, baseType: !741, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "clientid__index_hash", file: !49, line: 432, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "msg_store", scope: !731, file: !49, line: 433, baseType: !381, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "msg_store_load", scope: !731, file: !49, line: 434, baseType: !745, size: 64, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_store_load", file: !49, line: 354, size: 576, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !746, file: !49, line: 355, baseType: !588, size: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "db_id", scope: !746, file: !49, line: 356, baseType: !387, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !746, file: !49, line: 357, baseType: !381, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "msg_store_count", scope: !731, file: !49, line: 438, baseType: !199, size: 32, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "msg_store_bytes", scope: !731, file: !49, line: 439, baseType: !390, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "config_file", scope: !731, file: !49, line: 440, baseType: !202, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !731, file: !49, line: 441, baseType: !755, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__config", file: !49, line: 273, size: 3200, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "allow_duplicate_messages", scope: !756, file: !49, line: 274, baseType: !279, size: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "autosave_interval", scope: !756, file: !49, line: 275, baseType: !199, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "autosave_on_changes", scope: !756, file: !49, line: 276, baseType: !279, size: 8, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "check_retain_source", scope: !756, file: !49, line: 277, baseType: !279, size: 8, offset: 72)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "clientid_prefixes", scope: !756, file: !49, line: 278, baseType: !202, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "connection_messages", scope: !756, file: !49, line: 279, baseType: !279, size: 8, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "daemon", scope: !756, file: !49, line: 280, baseType: !279, size: 8, offset: 200)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "default_listener", scope: !756, file: !49, line: 281, baseType: !395, size: 1280, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "listeners", scope: !756, file: !49, line: 282, baseType: !394, size: 64, offset: 1536)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "listener_count", scope: !756, file: !49, line: 283, baseType: !199, size: 32, offset: 1600)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "log_dest", scope: !756, file: !49, line: 284, baseType: !199, size: 32, offset: 1632)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "log_facility", scope: !756, file: !49, line: 285, baseType: !199, size: 32, offset: 1664)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "log_type", scope: !756, file: !49, line: 286, baseType: !199, size: 32, offset: 1696)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "log_timestamp", scope: !756, file: !49, line: 287, baseType: !279, size: 8, offset: 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "log_timestamp_format", scope: !756, file: !49, line: 288, baseType: !202, size: 64, offset: 1792)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "log_file", scope: !756, file: !49, line: 289, baseType: !202, size: 64, offset: 1856)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "log_fptr", scope: !756, file: !49, line: 290, baseType: !775, size: 64, offset: 1920)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !777, line: 7, baseType: !778)
!777 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !779, line: 245, size: 1728, elements: !780)
!779 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !801, !802, !803, !804, !806, !807, !808, !812, !815, !817, !818, !819, !820, !821, !823, !824}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !778, file: !779, line: 246, baseType: !199, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !778, file: !779, line: 251, baseType: !202, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !778, file: !779, line: 252, baseType: !202, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !778, file: !779, line: 253, baseType: !202, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !778, file: !779, line: 254, baseType: !202, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !778, file: !779, line: 255, baseType: !202, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !778, file: !779, line: 256, baseType: !202, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !778, file: !779, line: 257, baseType: !202, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !778, file: !779, line: 258, baseType: !202, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !778, file: !779, line: 260, baseType: !202, size: 64, offset: 576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !778, file: !779, line: 261, baseType: !202, size: 64, offset: 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !778, file: !779, line: 262, baseType: !202, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !778, file: !779, line: 264, baseType: !794, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !779, line: 160, size: 192, elements: !796)
!796 = !{!797, !798, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !795, file: !779, line: 161, baseType: !794, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !795, file: !779, line: 162, baseType: !799, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !795, file: !779, line: 166, baseType: !199, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !778, file: !779, line: 266, baseType: !799, size: 64, offset: 832)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !778, file: !779, line: 268, baseType: !199, size: 32, offset: 896)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !778, file: !779, line: 272, baseType: !199, size: 32, offset: 928)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !778, file: !779, line: 274, baseType: !805, size: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !211, line: 140, baseType: !219)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !778, file: !779, line: 278, baseType: !212, size: 16, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !778, file: !779, line: 279, baseType: !244, size: 8, offset: 1040)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !778, file: !779, line: 280, baseType: !809, size: 8, offset: 1048)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 8, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 1)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !778, file: !779, line: 284, baseType: !813, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !779, line: 154, baseType: null)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !778, file: !779, line: 293, baseType: !816, size: 64, offset: 1152)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !211, line: 141, baseType: !219)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !778, file: !779, line: 301, baseType: !190, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !778, file: !779, line: 302, baseType: !190, size: 64, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !778, file: !779, line: 303, baseType: !190, size: 64, offset: 1344)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !778, file: !779, line: 304, baseType: !190, size: 64, offset: 1408)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !778, file: !779, line: 306, baseType: !822, size: 64, offset: 1472)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !611, line: 62, baseType: !390)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !778, file: !779, line: 307, baseType: !199, size: 32, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !778, file: !779, line: 309, baseType: !825, size: 160, offset: 1568)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 160, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 20)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "max_inflight_messages", scope: !756, file: !49, line: 291, baseType: !208, size: 16, offset: 1984)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max_keepalive", scope: !756, file: !49, line: 292, baseType: !208, size: 16, offset: 2000)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !756, file: !49, line: 293, baseType: !232, size: 32, offset: 2016)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "message_size_limit", scope: !756, file: !49, line: 294, baseType: !232, size: 32, offset: 2048)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "persistence", scope: !756, file: !49, line: 295, baseType: !279, size: 8, offset: 2080)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_location", scope: !756, file: !49, line: 296, baseType: !202, size: 64, offset: 2112)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_file", scope: !756, file: !49, line: 297, baseType: !202, size: 64, offset: 2176)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_filepath", scope: !756, file: !49, line: 298, baseType: !202, size: 64, offset: 2240)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_client_expiration", scope: !756, file: !49, line: 299, baseType: !216, size: 64, offset: 2304)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pid_file", scope: !756, file: !49, line: 300, baseType: !202, size: 64, offset: 2368)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "queue_qos0_messages", scope: !756, file: !49, line: 301, baseType: !279, size: 8, offset: 2432)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "per_listener_settings", scope: !756, file: !49, line: 302, baseType: !279, size: 8, offset: 2440)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "retain_available", scope: !756, file: !49, line: 303, baseType: !279, size: 8, offset: 2448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "set_tcp_nodelay", scope: !756, file: !49, line: 304, baseType: !279, size: 8, offset: 2456)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sys_interval", scope: !756, file: !49, line: 305, baseType: !199, size: 32, offset: 2464)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade_outgoing_qos", scope: !756, file: !49, line: 306, baseType: !279, size: 8, offset: 2496)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !756, file: !49, line: 307, baseType: !202, size: 64, offset: 2560)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "security_options", scope: !756, file: !49, line: 317, baseType: !413, size: 576, offset: 2624)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "auth_plugin_count", scope: !731, file: !49, line: 442, baseType: !199, size: 32, offset: 896)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !731, file: !49, line: 443, baseType: !279, size: 8, offset: 928)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_changes", scope: !731, file: !49, line: 449, baseType: !199, size: 32, offset: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ll_for_free", scope: !731, file: !49, line: 450, baseType: !194, size: 64, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!851 = !{}
!852 = !DILocalVariable(name: "db", arg: 1, scope: !727, file: !1, line: 87, type: !730)
!853 = !DILocation(line: 87, column: 48, scope: !727)
!854 = !DILocalVariable(name: "context", arg: 2, scope: !727, file: !1, line: 87, type: !194)
!855 = !DILocation(line: 87, column: 70, scope: !727)
!856 = !DILocalVariable(name: "head", arg: 3, scope: !727, file: !1, line: 87, type: !850)
!857 = !DILocation(line: 87, column: 109, scope: !727)
!858 = !DILocalVariable(name: "msg_tail", scope: !727, file: !1, line: 89, type: !375)
!859 = !DILocation(line: 89, column: 31, scope: !727)
!860 = !DILocalVariable(name: "tmp", scope: !727, file: !1, line: 89, type: !375)
!861 = !DILocation(line: 89, column: 42, scope: !727)
!862 = !DILocation(line: 91, column: 2, scope: !863)
!863 = distinct !DILexicalBlock(scope: !727, file: !1, line: 91, column: 2)
!864 = !DILocation(line: 91, column: 2, scope: !865)
!865 = distinct !DILexicalBlock(scope: !863, file: !1, line: 91, column: 2)
!866 = !DILocation(line: 92, column: 6, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !1, line: 92, column: 6)
!868 = distinct !DILexicalBlock(scope: !865, file: !1, line: 91, column: 41)
!869 = !DILocation(line: 92, column: 16, scope: !867)
!870 = !DILocation(line: 92, column: 26, scope: !867)
!871 = !DILocation(line: 92, column: 6, scope: !868)
!872 = !DILocation(line: 93, column: 27, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !1, line: 93, column: 7)
!874 = distinct !DILexicalBlock(scope: !867, file: !1, line: 92, column: 41)
!875 = !DILocation(line: 93, column: 31, scope: !873)
!876 = !DILocation(line: 93, column: 40, scope: !873)
!877 = !DILocation(line: 93, column: 50, scope: !873)
!878 = !DILocation(line: 93, column: 57, scope: !873)
!879 = !DILocation(line: 94, column: 12, scope: !873)
!880 = !DILocation(line: 94, column: 22, scope: !873)
!881 = !DILocation(line: 94, column: 29, scope: !873)
!882 = !DILocation(line: 94, column: 41, scope: !873)
!883 = !DILocation(line: 95, column: 12, scope: !873)
!884 = !DILocation(line: 95, column: 22, scope: !873)
!885 = !DILocation(line: 95, column: 29, scope: !873)
!886 = !DILocation(line: 95, column: 34, scope: !873)
!887 = !DILocation(line: 95, column: 44, scope: !873)
!888 = !DILocation(line: 95, column: 51, scope: !873)
!889 = !DILocation(line: 93, column: 7, scope: !873)
!890 = !DILocation(line: 95, column: 74, scope: !873)
!891 = !DILocation(line: 93, column: 7, scope: !874)
!892 = !DILocation(line: 97, column: 5, scope: !893)
!893 = distinct !DILexicalBlock(scope: !873, file: !1, line: 95, column: 94)
!894 = distinct !{!894, !892, !892}
!895 = !DILocation(line: 97, column: 5, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 97, column: 5)
!897 = distinct !DILexicalBlock(scope: !898, file: !1, line: 97, column: 5)
!898 = distinct !DILexicalBlock(scope: !893, file: !1, line: 97, column: 5)
!899 = !DILocation(line: 97, column: 5, scope: !897)
!900 = !DILocation(line: 97, column: 5, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !1, line: 97, column: 5)
!902 = distinct !DILexicalBlock(scope: !898, file: !1, line: 97, column: 5)
!903 = !DILocation(line: 97, column: 5, scope: !902)
!904 = !DILocation(line: 97, column: 5, scope: !905)
!905 = distinct !DILexicalBlock(scope: !898, file: !1, line: 97, column: 5)
!906 = !DILocation(line: 97, column: 5, scope: !898)
!907 = !DILocation(line: 97, column: 5, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !1, line: 97, column: 5)
!909 = !DILocation(line: 97, column: 5, scope: !910)
!910 = distinct !DILexicalBlock(scope: !905, file: !1, line: 97, column: 5)
!911 = !DILocation(line: 97, column: 5, scope: !912)
!912 = distinct !DILexicalBlock(scope: !910, file: !1, line: 97, column: 5)
!913 = !DILocation(line: 97, column: 5, scope: !914)
!914 = distinct !DILexicalBlock(scope: !910, file: !1, line: 97, column: 5)
!915 = !DILocation(line: 97, column: 5, scope: !916)
!916 = distinct !DILexicalBlock(scope: !914, file: !1, line: 97, column: 5)
!917 = !DILocation(line: 97, column: 5, scope: !918)
!918 = distinct !DILexicalBlock(scope: !916, file: !1, line: 97, column: 5)
!919 = !DILocation(line: 97, column: 5, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !1, line: 97, column: 5)
!921 = !DILocation(line: 98, column: 27, scope: !893)
!922 = !DILocation(line: 98, column: 32, scope: !893)
!923 = !DILocation(line: 98, column: 42, scope: !893)
!924 = !DILocation(line: 98, column: 5, scope: !893)
!925 = !DILocation(line: 99, column: 34, scope: !893)
!926 = !DILocation(line: 99, column: 44, scope: !893)
!927 = !DILocation(line: 99, column: 5, scope: !893)
!928 = !DILocation(line: 100, column: 21, scope: !893)
!929 = !DILocation(line: 100, column: 5, scope: !893)
!930 = !DILocation(line: 101, column: 4, scope: !893)
!931 = !DILocation(line: 102, column: 3, scope: !874)
!932 = !DILocation(line: 103, column: 2, scope: !868)
!933 = distinct !{!933, !862, !934}
!934 = !DILocation(line: 103, column: 2, scope: !863)
!935 = !DILocation(line: 104, column: 1, scope: !727)
!936 = distinct !DISubprogram(name: "connect__on_authorised", scope: !1, file: !1, line: 107, type: !937, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !851)
!937 = !DISubroutineType(types: !938)
!938 = !{!199, !730, !194, !190, !208}
!939 = !DILocalVariable(name: "db", arg: 1, scope: !936, file: !1, line: 107, type: !730)
!940 = !DILocation(line: 107, column: 49, scope: !936)
!941 = !DILocalVariable(name: "context", arg: 2, scope: !936, file: !1, line: 107, type: !194)
!942 = !DILocation(line: 107, column: 71, scope: !936)
!943 = !DILocalVariable(name: "auth_data_out", arg: 3, scope: !936, file: !1, line: 107, type: !190)
!944 = !DILocation(line: 107, column: 86, scope: !936)
!945 = !DILocalVariable(name: "auth_data_out_len", arg: 4, scope: !936, file: !1, line: 107, type: !208)
!946 = !DILocation(line: 107, column: 110, scope: !936)
!947 = !DILocalVariable(name: "found_context", scope: !936, file: !1, line: 109, type: !194)
!948 = !DILocation(line: 109, column: 20, scope: !936)
!949 = !DILocalVariable(name: "leaf", scope: !936, file: !1, line: 110, type: !675)
!950 = !DILocation(line: 110, column: 29, scope: !936)
!951 = !DILocalVariable(name: "connack_props", scope: !936, file: !1, line: 111, type: !254)
!952 = !DILocation(line: 111, column: 22, scope: !936)
!953 = !DILocalVariable(name: "connect_ack", scope: !936, file: !1, line: 112, type: !227)
!954 = !DILocation(line: 112, column: 10, scope: !936)
!955 = !DILocalVariable(name: "i", scope: !936, file: !1, line: 113, type: !199)
!956 = !DILocation(line: 113, column: 6, scope: !936)
!957 = !DILocalVariable(name: "rc", scope: !936, file: !1, line: 114, type: !199)
!958 = !DILocation(line: 114, column: 6, scope: !936)
!959 = !DILocation(line: 117, column: 2, scope: !936)
!960 = distinct !{!960, !959, !959}
!961 = !DILocalVariable(name: "_hf_bkt", scope: !962, file: !1, line: 117, type: !193)
!962 = distinct !DILexicalBlock(scope: !936, file: !1, line: 117, column: 2)
!963 = !DILocation(line: 117, column: 2, scope: !962)
!964 = !DILocalVariable(name: "_hf_hashv", scope: !962, file: !1, line: 117, type: !193)
!965 = !DILocation(line: 117, column: 2, scope: !966)
!966 = distinct !DILexicalBlock(scope: !962, file: !1, line: 117, column: 2)
!967 = !DILocation(line: 117, column: 2, scope: !968)
!968 = distinct !DILexicalBlock(scope: !966, file: !1, line: 117, column: 2)
!969 = distinct !{!969, !967, !967}
!970 = !DILocalVariable(name: "_hj_i", scope: !971, file: !1, line: 117, type: !193)
!971 = distinct !DILexicalBlock(scope: !968, file: !1, line: 117, column: 2)
!972 = !DILocation(line: 117, column: 2, scope: !971)
!973 = !DILocalVariable(name: "_hj_j", scope: !971, file: !1, line: 117, type: !193)
!974 = !DILocalVariable(name: "_hj_k", scope: !971, file: !1, line: 117, type: !193)
!975 = !DILocalVariable(name: "_hj_key", scope: !971, file: !1, line: 117, type: !191)
!976 = !DILocation(line: 117, column: 2, scope: !977)
!977 = distinct !DILexicalBlock(scope: !971, file: !1, line: 117, column: 2)
!978 = distinct !{!978, !976, !976}
!979 = !DILocation(line: 117, column: 2, scope: !980)
!980 = distinct !DILexicalBlock(scope: !977, file: !1, line: 117, column: 2)
!981 = distinct !{!981, !972, !972}
!982 = !DILocation(line: 117, column: 2, scope: !983)
!983 = distinct !DILexicalBlock(scope: !971, file: !1, line: 117, column: 2)
!984 = distinct !{!984, !972, !972}
!985 = !DILocation(line: 117, column: 2, scope: !986)
!986 = distinct !DILexicalBlock(scope: !971, file: !1, line: 117, column: 2)
!987 = !DILocation(line: 117, column: 2, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !1, line: 117, column: 2)
!989 = distinct !DILexicalBlock(scope: !968, file: !1, line: 117, column: 2)
!990 = distinct !{!990, !987, !987}
!991 = !DILocation(line: 117, column: 2, scope: !992)
!992 = distinct !DILexicalBlock(scope: !993, file: !1, line: 117, column: 2)
!993 = distinct !DILexicalBlock(scope: !988, file: !1, line: 117, column: 2)
!994 = !DILocation(line: 117, column: 2, scope: !993)
!995 = distinct !{!995, !991, !991}
!996 = !DILocation(line: 117, column: 2, scope: !997)
!997 = distinct !DILexicalBlock(scope: !992, file: !1, line: 117, column: 2)
!998 = !DILocation(line: 117, column: 2, scope: !999)
!999 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 117, column: 2)
!1000 = distinct !DILexicalBlock(scope: !993, file: !1, line: 117, column: 2)
!1001 = !DILocation(line: 117, column: 2, scope: !1000)
!1002 = !DILocation(line: 117, column: 2, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !1, line: 117, column: 2)
!1004 = distinct !DILexicalBlock(scope: !999, file: !1, line: 117, column: 2)
!1005 = !DILocation(line: 117, column: 2, scope: !1004)
!1006 = !DILocation(line: 117, column: 2, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 117, column: 2)
!1008 = distinct !{!1008, !1006, !1006}
!1009 = !DILocation(line: 117, column: 2, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !1, line: 117, column: 2)
!1011 = distinct !{!1011, !994, !994}
!1012 = !DILocation(line: 118, column: 5, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !936, file: !1, line: 118, column: 5)
!1014 = !DILocation(line: 118, column: 5, scope: !936)
!1015 = !DILocation(line: 120, column: 6, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 120, column: 6)
!1017 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 118, column: 19)
!1018 = !DILocation(line: 120, column: 21, scope: !1016)
!1019 = !DILocation(line: 120, column: 26, scope: !1016)
!1020 = !DILocation(line: 120, column: 6, scope: !1017)
!1021 = !DILocation(line: 123, column: 3, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 120, column: 44)
!1023 = !DILocation(line: 126, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !1, line: 126, column: 7)
!1025 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 123, column: 8)
!1026 = !DILocation(line: 126, column: 11, scope: !1024)
!1027 = !DILocation(line: 126, column: 19, scope: !1024)
!1028 = !DILocation(line: 126, column: 39, scope: !1024)
!1029 = !DILocation(line: 126, column: 7, scope: !1025)
!1030 = !DILocation(line: 127, column: 93, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 126, column: 47)
!1032 = !DILocation(line: 127, column: 102, scope: !1031)
!1033 = !DILocation(line: 127, column: 5, scope: !1031)
!1034 = !DILocation(line: 128, column: 4, scope: !1031)
!1035 = !DILocation(line: 131, column: 6, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 131, column: 6)
!1037 = !DILocation(line: 131, column: 15, scope: !1036)
!1038 = !DILocation(line: 131, column: 27, scope: !1036)
!1039 = !DILocation(line: 131, column: 36, scope: !1036)
!1040 = !DILocation(line: 131, column: 39, scope: !1036)
!1041 = !DILocation(line: 131, column: 54, scope: !1036)
!1042 = !DILocation(line: 131, column: 78, scope: !1036)
!1043 = !DILocation(line: 131, column: 6, scope: !1017)
!1044 = !DILocation(line: 132, column: 7, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !1, line: 132, column: 7)
!1046 = distinct !DILexicalBlock(scope: !1036, file: !1, line: 131, column: 82)
!1047 = !DILocation(line: 132, column: 16, scope: !1045)
!1048 = !DILocation(line: 132, column: 25, scope: !1045)
!1049 = !DILocation(line: 132, column: 43, scope: !1045)
!1050 = !DILocation(line: 132, column: 46, scope: !1045)
!1051 = !DILocation(line: 132, column: 55, scope: !1045)
!1052 = !DILocation(line: 132, column: 64, scope: !1045)
!1053 = !DILocation(line: 132, column: 7, scope: !1046)
!1054 = !DILocation(line: 133, column: 17, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1045, file: !1, line: 132, column: 80)
!1056 = !DILocation(line: 134, column: 4, scope: !1055)
!1057 = !DILocation(line: 136, column: 7, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1046, file: !1, line: 136, column: 7)
!1059 = !DILocation(line: 136, column: 22, scope: !1058)
!1060 = !DILocation(line: 136, column: 30, scope: !1058)
!1061 = !DILocation(line: 136, column: 39, scope: !1058)
!1062 = !DILocation(line: 136, column: 42, scope: !1058)
!1063 = !DILocation(line: 136, column: 57, scope: !1058)
!1064 = !DILocation(line: 136, column: 65, scope: !1058)
!1065 = !DILocation(line: 137, column: 6, scope: !1058)
!1066 = !DILocation(line: 137, column: 9, scope: !1058)
!1067 = !DILocation(line: 137, column: 24, scope: !1058)
!1068 = !DILocation(line: 137, column: 33, scope: !1058)
!1069 = !DILocation(line: 137, column: 42, scope: !1058)
!1070 = !DILocation(line: 137, column: 45, scope: !1058)
!1071 = !DILocation(line: 137, column: 60, scope: !1058)
!1072 = !DILocation(line: 137, column: 69, scope: !1058)
!1073 = !DILocation(line: 136, column: 7, scope: !1046)
!1074 = !DILocation(line: 139, column: 13, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1058, file: !1, line: 137, column: 76)
!1076 = !DILocation(line: 139, column: 22, scope: !1075)
!1077 = !DILocation(line: 139, column: 5, scope: !1075)
!1078 = !DILocation(line: 139, column: 32, scope: !1075)
!1079 = !DILocation(line: 139, column: 47, scope: !1075)
!1080 = !DILocation(line: 140, column: 13, scope: !1075)
!1081 = !DILocation(line: 140, column: 22, scope: !1075)
!1082 = !DILocation(line: 140, column: 5, scope: !1075)
!1083 = !DILocation(line: 140, column: 33, scope: !1075)
!1084 = !DILocation(line: 140, column: 48, scope: !1075)
!1085 = !DILocation(line: 142, column: 13, scope: !1075)
!1086 = !DILocation(line: 142, column: 28, scope: !1075)
!1087 = !DILocation(line: 142, column: 5, scope: !1075)
!1088 = !DILocation(line: 143, column: 13, scope: !1075)
!1089 = !DILocation(line: 143, column: 28, scope: !1075)
!1090 = !DILocation(line: 143, column: 5, scope: !1075)
!1091 = !DILocation(line: 145, column: 33, scope: !1075)
!1092 = !DILocation(line: 145, column: 37, scope: !1075)
!1093 = !DILocation(line: 145, column: 5, scope: !1075)
!1094 = !DILocation(line: 146, column: 4, scope: !1075)
!1095 = !DILocation(line: 147, column: 20, scope: !1046)
!1096 = !DILocation(line: 147, column: 35, scope: !1046)
!1097 = !DILocation(line: 147, column: 4, scope: !1046)
!1098 = !DILocation(line: 147, column: 13, scope: !1046)
!1099 = !DILocation(line: 147, column: 18, scope: !1046)
!1100 = !DILocation(line: 148, column: 4, scope: !1046)
!1101 = !DILocation(line: 148, column: 19, scope: !1046)
!1102 = !DILocation(line: 148, column: 24, scope: !1046)
!1103 = !DILocation(line: 149, column: 25, scope: !1046)
!1104 = !DILocation(line: 149, column: 40, scope: !1046)
!1105 = !DILocation(line: 149, column: 4, scope: !1046)
!1106 = !DILocation(line: 149, column: 13, scope: !1046)
!1107 = !DILocation(line: 149, column: 23, scope: !1046)
!1108 = !DILocation(line: 150, column: 4, scope: !1046)
!1109 = !DILocation(line: 150, column: 19, scope: !1046)
!1110 = !DILocation(line: 150, column: 29, scope: !1046)
!1111 = !DILocation(line: 151, column: 24, scope: !1046)
!1112 = !DILocation(line: 151, column: 39, scope: !1046)
!1113 = !DILocation(line: 151, column: 4, scope: !1046)
!1114 = !DILocation(line: 151, column: 13, scope: !1046)
!1115 = !DILocation(line: 151, column: 22, scope: !1046)
!1116 = !DILocation(line: 153, column: 9, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1046, file: !1, line: 153, column: 4)
!1118 = !DILocation(line: 153, column: 8, scope: !1117)
!1119 = !DILocation(line: 153, column: 13, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1117, file: !1, line: 153, column: 4)
!1121 = !DILocation(line: 153, column: 15, scope: !1120)
!1122 = !DILocation(line: 153, column: 24, scope: !1120)
!1123 = !DILocation(line: 153, column: 14, scope: !1120)
!1124 = !DILocation(line: 153, column: 4, scope: !1117)
!1125 = !DILocation(line: 154, column: 8, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 154, column: 8)
!1127 = distinct !DILexicalBlock(scope: !1120, file: !1, line: 153, column: 39)
!1128 = !DILocation(line: 154, column: 17, scope: !1126)
!1129 = !DILocation(line: 154, column: 22, scope: !1126)
!1130 = !DILocation(line: 154, column: 8, scope: !1127)
!1131 = !DILocation(line: 155, column: 13, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1126, file: !1, line: 154, column: 25)
!1133 = !DILocation(line: 155, column: 22, scope: !1132)
!1134 = !DILocation(line: 155, column: 27, scope: !1132)
!1135 = !DILocation(line: 155, column: 31, scope: !1132)
!1136 = !DILocation(line: 155, column: 11, scope: !1132)
!1137 = !DILocation(line: 156, column: 6, scope: !1132)
!1138 = !DILocation(line: 156, column: 12, scope: !1132)
!1139 = !DILocation(line: 157, column: 10, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !1, line: 157, column: 10)
!1141 = distinct !DILexicalBlock(scope: !1132, file: !1, line: 156, column: 17)
