; ModuleID = 'send_connect.bc'
source_filename = "../lib/send_connect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.mosquitto = type { i32, i32, i8*, i8*, i8*, i8*, i16, i16, i32, i64, i64, i64, %struct.mosquitto__packet, %struct.mosquitto__packet*, %struct.mosquitto__packet*, %struct.mosquitto_message_all*, %struct.mosquitto__alias*, %struct.will_delay_list*, i32, i32, i32, i64, i8, i8, i8, i32, i64, i8, i8, i8, %struct.mosquitto__bridge*, %struct.mosquitto_msg_data, %struct.mosquitto_msg_data, %struct.mosquitto__acl_user*, %struct.mosquitto__listener*, %struct.mosquitto__packet*, %struct.mosquitto__subhier**, %struct.mosquitto__subshared_ref**, i8*, i32, i32, i32, i8, i8, i8, %struct.UT_hash_handle, %struct.UT_hash_handle, %struct.mosquitto*, %struct.session_expiry_list*, i32 }
%struct.mosquitto__packet = type { i8*, %struct.mosquitto__packet*, i32, i32, i32, i32, i32, i16, i8, i8 }
%struct.mosquitto_message_all = type { %struct.mosquitto_message_all*, %struct.mosquitto_message_all*, %struct.mqtt5__property*, i64, i32, i8, %struct.mosquitto_message, i32 }
%struct.mosquitto_message = type { i32, i8*, i8*, i32, i32, i8 }
%struct.mosquitto__alias = type { i8*, i16 }
%struct.will_delay_list = type { %struct.mosquitto*, %struct.will_delay_list*, %struct.will_delay_list* }

!101 = !DIEnumerator(name: "MOSQ_ERR_QOS_NOT_SUPPORTED", value: 24)
!102 = !DIEnumerator(name: "MOSQ_ERR_OVERSIZE_PACKET", value: 25)
!103 = !DIEnumerator(name: "MOSQ_ERR_OCSP", value: 26)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_property", file: !105, line: 108, size: 32, elements: !106)
!105 = !DIFile(filename: "../lib/mqtt_protocol.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!107 = !DIEnumerator(name: "MQTT_PROP_PAYLOAD_FORMAT_INDICATOR", value: 1)
!108 = !DIEnumerator(name: "MQTT_PROP_MESSAGE_EXPIRY_INTERVAL", value: 2)
!109 = !DIEnumerator(name: "MQTT_PROP_CONTENT_TYPE", value: 3)
!110 = !DIEnumerator(name: "MQTT_PROP_RESPONSE_TOPIC", value: 8)
!111 = !DIEnumerator(name: "MQTT_PROP_CORRELATION_DATA", value: 9)
!112 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_IDENTIFIER", value: 11)
!113 = !DIEnumerator(name: "MQTT_PROP_SESSION_EXPIRY_INTERVAL", value: 17)
!114 = !DIEnumerator(name: "MQTT_PROP_ASSIGNED_CLIENT_IDENTIFIER", value: 18)
!115 = !DIEnumerator(name: "MQTT_PROP_SERVER_KEEP_ALIVE", value: 19)
!116 = !DIEnumerator(name: "MQTT_PROP_AUTHENTICATION_METHOD", value: 21)
!117 = !DIEnumerator(name: "MQTT_PROP_AUTHENTICATION_DATA", value: 22)
!118 = !DIEnumerator(name: "MQTT_PROP_REQUEST_PROBLEM_INFORMATION", value: 23)
!119 = !DIEnumerator(name: "MQTT_PROP_WILL_DELAY_INTERVAL", value: 24)
!120 = !DIEnumerator(name: "MQTT_PROP_REQUEST_RESPONSE_INFORMATION", value: 25)
!121 = !DIEnumerator(name: "MQTT_PROP_RESPONSE_INFORMATION", value: 26)
!122 = !DIEnumerator(name: "MQTT_PROP_SERVER_REFERENCE", value: 28)
!123 = !DIEnumerator(name: "MQTT_PROP_REASON_STRING", value: 31)
!124 = !DIEnumerator(name: "MQTT_PROP_RECEIVE_MAXIMUM", value: 33)
!125 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS_MAXIMUM", value: 34)
!126 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS", value: 35)
!127 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_QOS", value: 36)
!128 = !DIEnumerator(name: "MQTT_PROP_RETAIN_AVAILABLE", value: 37)
!129 = !DIEnumerator(name: "MQTT_PROP_USER_PROPERTY", value: 38)
!130 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_PACKET_SIZE", value: 39)
!131 = !DIEnumerator(name: "MQTT_PROP_WILDCARD_SUB_AVAILABLE", value: 40)
!132 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_ID_AVAILABLE", value: 41)
!133 = !DIEnumerator(name: "MQTT_PROP_SHARED_SUB_AVAILABLE", value: 42)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!139 = !{i32 2, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 1, !"wchar_size", i32 4}
!142 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!143 = distinct !DISubprogram(name: "simple_encrypt", scope: !1, file: !1, line: 37, type: !144, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !147)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !146}
!146 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!147 = !{}
!148 = !DILocalVariable(name: "val", arg: 1, scope: !143, file: !1, line: 37, type: !146)
!149 = !DILocation(line: 37, column: 24, scope: !143)
!150 = !DILocalVariable(name: "key", scope: !143, file: !1, line: 38, type: !146)
!151 = !DILocation(line: 38, column: 6, scope: !143)
!152 = !DILocalVariable(name: "encrypted", scope: !143, file: !1, line: 40, type: !146)
!153 = !DILocation(line: 40, column: 6, scope: !143)
!154 = !DILocation(line: 40, column: 18, scope: !143)
!155 = !DILocation(line: 40, column: 24, scope: !143)
!156 = !DILocation(line: 40, column: 22, scope: !143)
!157 = !DILocation(line: 42, column: 9, scope: !143)
!158 = !DILocation(line: 42, column: 2, scope: !143)
!159 = distinct !DISubprogram(name: "change_static_value", scope: !1, file: !1, line: 46, type: !144, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !147)
!160 = !DILocalVariable(name: "static_value", arg: 1, scope: !159, file: !1, line: 46, type: !146)
!161 = !DILocation(line: 46, column: 29, scope: !159)
!162 = !DILocalVariable(name: "nonce", scope: !159, file: !1, line: 47, type: !163)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 128, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4)
!166 = !DILocation(line: 47, column: 6, scope: !159)
!167 = !DILocalVariable(name: "rawtime", scope: !159, file: !1, line: 48, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !169, line: 7, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !171, line: 148, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !DILocation(line: 48, column: 9, scope: !159)
!174 = !DILocalVariable(name: "ptm", scope: !159, file: !1, line: 49, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !177, line: 7, size: 448, elements: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !176, file: !177, line: 9, baseType: !146, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !176, file: !177, line: 10, baseType: !146, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !176, file: !177, line: 11, baseType: !146, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !176, file: !177, line: 12, baseType: !146, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !176, file: !177, line: 13, baseType: !146, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !176, file: !177, line: 14, baseType: !146, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !176, file: !177, line: 15, baseType: !146, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !176, file: !177, line: 16, baseType: !146, size: 32, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !176, file: !177, line: 17, baseType: !146, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !176, file: !177, line: 20, baseType: !172, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !176, file: !177, line: 21, baseType: !136, size: 64, offset: 384)
!190 = !DILocation(line: 49, column: 17, scope: !159)
!191 = !DILocation(line: 50, column: 2, scope: !159)
!192 = !DILocation(line: 51, column: 8, scope: !159)
!193 = !DILocation(line: 51, column: 6, scope: !159)
!194 = !DILocation(line: 53, column: 7, scope: !195)
!195 = distinct !DILexicalBlock(scope: !159, file: !1, line: 53, column: 6)
!196 = !DILocation(line: 53, column: 12, scope: !195)
!197 = !DILocation(line: 53, column: 20, scope: !195)
!198 = !DILocation(line: 53, column: 24, scope: !195)
!199 = !DILocation(line: 53, column: 6, scope: !159)
!200 = !DILocation(line: 54, column: 18, scope: !201)
!201 = distinct !DILexicalBlock(scope: !195, file: !1, line: 53, column: 30)
!202 = !DILocation(line: 54, column: 30, scope: !201)
!203 = !DILocation(line: 54, column: 35, scope: !201)
!204 = !DILocation(line: 54, column: 33, scope: !201)
!205 = !DILocation(line: 54, column: 16, scope: !201)
!206 = !DILocation(line: 55, column: 2, scope: !201)
!207 = !DILocation(line: 56, column: 18, scope: !208)
!208 = distinct !DILexicalBlock(scope: !195, file: !1, line: 55, column: 9)
!209 = !DILocation(line: 56, column: 30, scope: !208)
!210 = !DILocation(line: 56, column: 35, scope: !208)
!211 = !DILocation(line: 56, column: 33, scope: !208)
!212 = !DILocation(line: 56, column: 16, scope: !208)
!213 = !DILocation(line: 58, column: 9, scope: !159)
!214 = !DILocation(line: 58, column: 2, scope: !159)
!215 = distinct !DISubprogram(name: "send__connect", scope: !1, file: !1, line: 61, type: !216, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !147)
!216 = !DISubroutineType(types: !217)
!217 = !{!146, !218, !230, !298, !737}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto", file: !4, line: 207, size: 4032, elements: !220)
!220 = !{!221, !223, !224, !226, !227, !228, !229, !234, !235, !236, !237, !238, !239, !264, !265, !266, !312, !318, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !390, !679, !680, !681, !682, !683, !712, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !736}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !219, file: !4, line: 208, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosq_sock_t", file: !4, line: 70, baseType: !146)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !219, file: !4, line: 215, baseType: !3, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !219, file: !4, line: 216, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !219, file: !4, line: 217, baseType: !225, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !219, file: !4, line: 218, baseType: !225, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !219, file: !4, line: 219, baseType: !225, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !219, file: !4, line: 220, baseType: !230, size: 16, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !231, line: 25, baseType: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !171, line: 39, baseType: !233)
!233 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "last_mid", scope: !219, file: !4, line: 221, baseType: !230, size: 16, offset: 336)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !219, file: !4, line: 222, baseType: !11, size: 32, offset: 352)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last_msg_in", scope: !219, file: !4, line: 223, baseType: !168, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next_msg_out", scope: !219, file: !4, line: 224, baseType: !168, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ping_t", scope: !219, file: !4, line: 225, baseType: !168, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "in_packet", scope: !219, file: !4, line: 226, baseType: !240, size: 320, offset: 576)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__packet", file: !4, line: 150, size: 320, elements: !241)
!241 = !{!242, !247, !249, !253, !254, !255, !256, !257, !258, !259}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !240, file: !4, line: 151, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !231, line: 24, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !171, line: 37, baseType: !246)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !4, line: 152, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_mult", scope: !240, file: !4, line: 153, baseType: !250, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !231, line: 26, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !171, line: 41, baseType: !252)
!252 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_length", scope: !240, file: !4, line: 154, baseType: !250, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !240, file: !4, line: 155, baseType: !250, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "to_process", scope: !240, file: !4, line: 156, baseType: !250, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !240, file: !4, line: 157, baseType: !250, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !240, file: !4, line: 158, baseType: !230, size: 16, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !240, file: !4, line: 159, baseType: !244, size: 8, offset: 304)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_count", scope: !240, file: !4, line: 160, baseType: !260, size: 8, offset: 312)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !261, line: 24, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !171, line: 36, baseType: !263)
!263 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "current_out_packet", scope: !219, file: !4, line: 227, baseType: !248, size: 64, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet", scope: !219, file: !4, line: 228, baseType: !248, size: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "will", scope: !219, file: !4, line: 229, baseType: !267, size: 64, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message_all", file: !4, line: 163, size: 704, elements: !269)
!269 = !{!270, !271, !272, !299, !300, !301, !302, !311}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !4, line: 164, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !4, line: 165, baseType: !267, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !268, file: !4, line: 166, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto_property", file: !71, line: 135, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt5__property", file: !276, line: 27, size: 384, elements: !277)
!276 = !DIFile(filename: "../lib/property_mosq.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!277 = !{!278, !280, !293, !294, !297}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !276, line: 28, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !275, file: !276, line: 36, baseType: !281, size: 128, offset: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 29, size: 128, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !292}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i8", scope: !281, file: !276, line: 30, baseType: !244, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i16", scope: !281, file: !276, line: 31, baseType: !230, size: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !281, file: !276, line: 32, baseType: !250, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "varint", scope: !281, file: !276, line: 33, baseType: !250, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !281, file: !276, line: 34, baseType: !288, size: 128)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt__string", file: !276, line: 22, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !288, file: !276, line: 23, baseType: !225, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !288, file: !276, line: 24, baseType: !146, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !281, file: !276, line: 35, baseType: !288, size: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !276, line: 37, baseType: !288, size: 128, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !275, file: !276, line: 38, baseType: !295, size: 32, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !261, line: 26, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !171, line: 40, baseType: !146)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "client_generated", scope: !275, file: !276, line: 39, baseType: !298, size: 8, offset: 352)
!298 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !268, file: !4, line: 167, baseType: !168, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !268, file: !4, line: 169, baseType: !34, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !268, file: !4, line: 170, baseType: !298, size: 8, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !268, file: !4, line: 171, baseType: !303, size: 320, offset: 320)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message", file: !71, line: 125, size: 320, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !303, file: !71, line: 126, baseType: !146, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !303, file: !71, line: 127, baseType: !225, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !303, file: !71, line: 128, baseType: !135, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !303, file: !71, line: 129, baseType: !146, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !303, file: !71, line: 130, baseType: !146, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !303, file: !71, line: 131, baseType: !298, size: 8, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_interval", scope: !268, file: !4, line: 172, baseType: !250, size: 32, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !219, file: !4, line: 230, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__alias", file: !4, line: 139, size: 128, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !314, file: !4, line: 140, baseType: !225, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !314, file: !4, line: 141, baseType: !230, size: 16, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_entry", scope: !219, file: !4, line: 231, baseType: !319, size: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "will_delay_list", file: !4, line: 182, size: 192, elements: !321)
!321 = !{!322, !323, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !320, file: !4, line: 183, baseType: !218, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !4, line: 184, baseType: !319, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !4, line: 185, baseType: !319, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_packet_size", scope: !219, file: !4, line: 232, baseType: !250, size: 32, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "alias_count", scope: !219, file: !4, line: 233, baseType: !146, size: 32, offset: 1248)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_interval", scope: !219, file: !4, line: 234, baseType: !250, size: 32, offset: 1280)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_time", scope: !219, file: !4, line: 235, baseType: !168, size: 64, offset: 1344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "want_write", scope: !219, file: !4, line: 257, baseType: !298, size: 8, offset: 1408)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "want_connect", scope: !219, file: !4, line: 258, baseType: !298, size: 8, offset: 1416)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "clean_start", scope: !219, file: !4, line: 269, baseType: !298, size: 8, offset: 1424)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_interval", scope: !219, file: !4, line: 270, baseType: !250, size: 32, offset: 1440)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_time", scope: !219, file: !4, line: 271, baseType: !168, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "removed_from_by_id", scope: !219, file: !4, line: 273, baseType: !298, size: 8, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "is_dropping", scope: !219, file: !4, line: 274, baseType: !298, size: 8, offset: 1544)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_bridge", scope: !219, file: !4, line: 275, baseType: !298, size: 8, offset: 1552)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !219, file: !4, line: 276, baseType: !338, size: 64, offset: 1600)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__bridge", file: !49, line: 484, size: 1344, elements: !340)
!340 = !{!341, !342, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !49, line: 485, baseType: !225, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "addresses", scope: !339, file: !49, line: 486, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bridge_address", file: !49, line: 479, size: 128, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !344, file: !49, line: 480, baseType: !225, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !344, file: !49, line: 481, baseType: !146, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cur_address", scope: !339, file: !49, line: 487, baseType: !146, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "address_count", scope: !339, file: !49, line: 488, baseType: !146, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "primary_retry", scope: !339, file: !49, line: 489, baseType: !168, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "primary_retry_sock", scope: !339, file: !49, line: 490, baseType: !222, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "round_robin", scope: !339, file: !49, line: 491, baseType: !298, size: 8, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "try_private", scope: !339, file: !49, line: 492, baseType: !298, size: 8, offset: 296)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "try_private_accepted", scope: !339, file: !49, line: 493, baseType: !298, size: 8, offset: 304)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "clean_start", scope: !339, file: !49, line: 494, baseType: !298, size: 8, offset: 312)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !339, file: !49, line: 495, baseType: !146, size: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "topics", scope: !339, file: !49, line: 496, baseType: !358, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__bridge_topic", file: !49, line: 469, size: 384, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !359, file: !49, line: 470, baseType: !225, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !359, file: !49, line: 471, baseType: !146, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !359, file: !49, line: 472, baseType: !48, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "local_prefix", scope: !359, file: !49, line: 473, baseType: !225, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "remote_prefix", scope: !359, file: !49, line: 474, baseType: !225, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "local_topic", scope: !359, file: !49, line: 475, baseType: !225, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "remote_topic", scope: !359, file: !49, line: 476, baseType: !225, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "topic_count", scope: !339, file: !49, line: 497, baseType: !146, size: 32, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "topic_remapping", scope: !339, file: !49, line: 498, baseType: !298, size: 8, offset: 480)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !339, file: !49, line: 499, baseType: !3, size: 32, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "restart_t", scope: !339, file: !49, line: 500, baseType: !168, size: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "remote_clientid", scope: !339, file: !49, line: 501, baseType: !225, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "remote_username", scope: !339, file: !49, line: 502, baseType: !225, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "remote_password", scope: !339, file: !49, line: 503, baseType: !225, size: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "local_clientid", scope: !339, file: !49, line: 504, baseType: !225, size: 64, offset: 832)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "local_username", scope: !339, file: !49, line: 505, baseType: !225, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "local_password", scope: !339, file: !49, line: 506, baseType: !225, size: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "notification_topic", scope: !339, file: !49, line: 507, baseType: !225, size: 64, offset: 1024)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "notifications", scope: !339, file: !49, line: 508, baseType: !298, size: 8, offset: 1088)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "notifications_local_only", scope: !339, file: !49, line: 509, baseType: !298, size: 8, offset: 1096)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "start_type", scope: !339, file: !49, line: 510, baseType: !54, size: 32, offset: 1120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !339, file: !49, line: 511, baseType: !146, size: 32, offset: 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "restart_timeout", scope: !339, file: !49, line: 512, baseType: !146, size: 32, offset: 1184)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "backoff_base", scope: !339, file: !49, line: 513, baseType: !146, size: 32, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "backoff_cap", scope: !339, file: !49, line: 514, baseType: !146, size: 32, offset: 1248)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !339, file: !49, line: 515, baseType: !146, size: 32, offset: 1280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lazy_reconnect", scope: !339, file: !49, line: 516, baseType: !298, size: 8, offset: 1312)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "attempt_unsubscribe", scope: !339, file: !49, line: 517, baseType: !298, size: 8, offset: 1320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "initial_notification_done", scope: !339, file: !49, line: 518, baseType: !298, size: 8, offset: 1328)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_in", scope: !219, file: !4, line: 277, baseType: !391, size: 384, offset: 1664)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_data", file: !4, line: 188, size: 384, elements: !392)
!392 = !{!393, !672, !673, !674, !675, !676, !677, !678}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "inflight", scope: !391, file: !4, line: 190, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_client_msg", file: !49, line: 382, size: 448, elements: !396)
!396 = !{!397, !398, !399, !664, !665, !666, !667, !668, !669, !670, !671}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !395, file: !49, line: 383, baseType: !394, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !395, file: !49, line: 384, baseType: !394, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !395, file: !49, line: 385, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_store", file: !49, line: 360, size: 896, elements: !402)
!402 = !{!403, !404, !405, !410, !411, !412, !642, !644, !645, !646, !647, !648, !657, !658, !659, !660, !661, !662, !663}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !401, file: !49, line: 361, baseType: !400, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !401, file: !49, line: 362, baseType: !400, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "db_id", scope: !401, file: !49, line: 363, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "dbid_t", file: !49, line: 135, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !231, line: 27, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !171, line: 44, baseType: !409)
!409 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !401, file: !49, line: 364, baseType: !225, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "source_username", scope: !401, file: !49, line: 365, baseType: !225, size: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "source_listener", scope: !401, file: !49, line: 366, baseType: !413, size: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__listener", file: !49, line: 230, size: 1280, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !424, !425, !426, !427, !428, !429, !430, !431, !598, !641}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !414, file: !49, line: 231, baseType: !146, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !414, file: !49, line: 232, baseType: !230, size: 16, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !414, file: !49, line: 233, baseType: !225, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bind_interface", scope: !414, file: !49, line: 234, baseType: !225, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_connections", scope: !414, file: !49, line: 235, baseType: !146, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mount_point", scope: !414, file: !49, line: 236, baseType: !225, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "socks", scope: !414, file: !49, line: 237, baseType: !423, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sock_count", scope: !414, file: !49, line: 238, baseType: !146, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "client_count", scope: !414, file: !49, line: 239, baseType: !146, size: 32, offset: 416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !414, file: !49, line: 240, baseType: !60, size: 32, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "socket_domain", scope: !414, file: !49, line: 241, baseType: !146, size: 32, offset: 480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "use_username_as_clientid", scope: !414, file: !49, line: 242, baseType: !298, size: 8, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_qos", scope: !414, file: !49, line: 243, baseType: !244, size: 8, offset: 520)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "max_topic_alias", scope: !414, file: !49, line: 244, baseType: !230, size: 16, offset: 528)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "security_options", scope: !414, file: !49, line: 268, baseType: !432, size: 576, offset: 576)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__security_options", file: !49, line: 212, size: 576, elements: !433)
!433 = !{!434, !449, !450, !451, !452, !453, !593, !594, !595, !596, !597}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "acl_list", scope: !432, file: !49, line: 217, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__acl_user", file: !49, line: 415, size: 192, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !49, line: 416, baseType: !435, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !436, file: !49, line: 417, baseType: !225, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "acl", scope: !436, file: !49, line: 418, baseType: !441, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__acl", file: !49, line: 407, size: 256, elements: !443)
!443 = !{!444, !445, !446, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !49, line: 408, baseType: !441, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !442, file: !49, line: 409, baseType: !225, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "access", scope: !442, file: !49, line: 410, baseType: !146, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ucount", scope: !442, file: !49, line: 411, baseType: !146, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ccount", scope: !442, file: !49, line: 412, baseType: !146, size: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "acl_patterns", scope: !432, file: !49, line: 218, baseType: !441, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "password_file", scope: !432, file: !49, line: 219, baseType: !225, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "psk_file", scope: !432, file: !49, line: 220, baseType: !225, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "acl_file", scope: !432, file: !49, line: 221, baseType: !225, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "auth_plugin_configs", scope: !432, file: !49, line: 222, baseType: !454, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__auth_plugin_config", file: !49, line: 202, size: 1920, elements: !456)
!456 = !{!457, !458, !465, !466, !467}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !455, file: !49, line: 204, baseType: !225, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !455, file: !49, line: 205, baseType: !459, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_opt", file: !461, line: 35, size: 128, elements: !462)
!461 = !DIFile(filename: "./mosquitto_plugin.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !460, file: !461, line: 36, baseType: !225, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !460, file: !461, line: 37, baseType: !225, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "option_count", scope: !455, file: !49, line: 206, baseType: !146, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "deny_special_chars", scope: !455, file: !49, line: 207, baseType: !298, size: 8, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "plugin", scope: !455, file: !49, line: 209, baseType: !468, size: 1728, offset: 192)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__auth_plugin", file: !49, line: 169, size: 1728, elements: !469)
!469 = !{!470, !471, !472, !476, !482, !487, !492, !494, !509, !514, !519, !525, !530, !532, !534, !536, !538, !545, !550, !555, !565, !570, !575, !577, !582, !587, !592}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !468, file: !49, line: 170, baseType: !135, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !468, file: !49, line: 171, baseType: !135, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_version", scope: !468, file: !49, line: 172, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!146}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_init_v4", scope: !468, file: !49, line: 174, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_init_v4", file: !49, line: 137, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!146, !481, !459, !146}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_cleanup_v4", scope: !468, file: !49, line: 175, baseType: !483, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_cleanup_v4", file: !49, line: 138, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!146, !135, !459, !146}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "security_init_v4", scope: !468, file: !49, line: 176, baseType: !488, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_init_v4", file: !49, line: 139, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!146, !135, !459, !146, !298}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "security_cleanup_v4", scope: !468, file: !49, line: 177, baseType: !493, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_cleanup_v4", file: !49, line: 140, baseType: !489)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "acl_check_v4", scope: !468, file: !49, line: 178, baseType: !495, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_acl_check_v4", file: !49, line: 141, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!146, !135, !146, !218, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_acl_msg", file: !461, line: 45, size: 256, elements: !501)
!501 = !{!502, !503, !506, !507, !508}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !500, file: !461, line: 46, baseType: !136, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !500, file: !461, line: 47, baseType: !504, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !500, file: !461, line: 48, baseType: !172, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !500, file: !461, line: 49, baseType: !146, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !500, file: !461, line: 50, baseType: !298, size: 8, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd_check_v4", scope: !468, file: !49, line: 179, baseType: !510, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_unpwd_check_v4", file: !49, line: 142, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!146, !135, !218, !136, !136}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "psk_key_get_v4", scope: !468, file: !49, line: 180, baseType: !515, size: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_psk_key_get_v4", file: !49, line: 143, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!146, !135, !218, !136, !136, !225, !146}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "auth_start_v4", scope: !468, file: !49, line: 181, baseType: !520, size: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_auth_start_v4", file: !49, line: 144, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!146, !135, !218, !136, !298, !504, !230, !481, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "auth_continue_v4", scope: !468, file: !49, line: 182, baseType: !526, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_auth_continue_v4", file: !49, line: 145, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!146, !135, !218, !136, !504, !230, !481, !524}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_init_v3", scope: !468, file: !49, line: 184, baseType: !531, size: 64, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_init_v3", file: !49, line: 147, baseType: !478)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_cleanup_v3", scope: !468, file: !49, line: 185, baseType: !533, size: 64, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_cleanup_v3", file: !49, line: 148, baseType: !484)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "security_init_v3", scope: !468, file: !49, line: 186, baseType: !535, size: 64, offset: 896)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_init_v3", file: !49, line: 149, baseType: !489)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "security_cleanup_v3", scope: !468, file: !49, line: 187, baseType: !537, size: 64, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_cleanup_v3", file: !49, line: 150, baseType: !489)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "acl_check_v3", scope: !468, file: !49, line: 188, baseType: !539, size: 64, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_acl_check_v3", file: !49, line: 151, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!146, !135, !146, !543, !499}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd_check_v3", scope: !468, file: !49, line: 189, baseType: !546, size: 64, offset: 1088)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_unpwd_check_v3", file: !49, line: 152, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!146, !135, !543, !136, !136}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "psk_key_get_v3", scope: !468, file: !49, line: 190, baseType: !551, size: 64, offset: 1152)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_psk_key_get_v3", file: !49, line: 153, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!146, !135, !543, !136, !136, !225, !146}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_init_v2", scope: !468, file: !49, line: 192, baseType: !556, size: 64, offset: 1216)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_init_v2", file: !49, line: 155, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!146, !481, !560, !146}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_auth_opt", file: !461, line: 40, size: 128, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !561, file: !461, line: 41, baseType: !225, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !561, file: !461, line: 42, baseType: !225, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_cleanup_v2", scope: !468, file: !49, line: 193, baseType: !566, size: 64, offset: 1280)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_cleanup_v2", file: !49, line: 156, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!146, !135, !560, !146}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "security_init_v2", scope: !468, file: !49, line: 194, baseType: !571, size: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_init_v2", file: !49, line: 157, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!146, !135, !560, !146, !298}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "security_cleanup_v2", scope: !468, file: !49, line: 195, baseType: !576, size: 64, offset: 1408)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_security_cleanup_v2", file: !49, line: 158, baseType: !572)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "acl_check_v2", scope: !468, file: !49, line: 196, baseType: !578, size: 64, offset: 1472)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_acl_check_v2", file: !49, line: 159, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!146, !135, !136, !136, !136, !146}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd_check_v2", scope: !468, file: !49, line: 197, baseType: !583, size: 64, offset: 1536)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_unpwd_check_v2", file: !49, line: 160, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!146, !135, !136, !136}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "psk_key_get_v2", scope: !468, file: !49, line: 198, baseType: !588, size: 64, offset: 1600)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNC_auth_plugin_psk_key_get_v2", file: !49, line: 161, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!146, !135, !136, !136, !225, !146}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !468, file: !49, line: 199, baseType: !146, size: 32, offset: 1664)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "auth_plugin_config_count", scope: !432, file: !49, line: 223, baseType: !146, size: 32, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "allow_anonymous", scope: !432, file: !49, line: 224, baseType: !260, size: 8, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "allow_zero_length_clientid", scope: !432, file: !49, line: 225, baseType: !298, size: 8, offset: 424)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "auto_id_prefix", scope: !432, file: !49, line: 226, baseType: !225, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "auto_id_prefix_len", scope: !432, file: !49, line: 227, baseType: !146, size: 32, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "unpwd", scope: !414, file: !49, line: 269, baseType: !599, size: 64, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__unpwd", file: !49, line: 396, size: 576, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !600, file: !49, line: 397, baseType: !225, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !600, file: !49, line: 398, baseType: !225, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !600, file: !49, line: 404, baseType: !605, size: 448, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "UT_hash_handle", file: !606, line: 946, baseType: !607)
!606 = !DIFile(filename: "../src/deps/uthash.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UT_hash_handle", file: !606, line: 937, size: 448, elements: !608)
!608 = !{!609, !634, !635, !636, !637, !638, !639, !640}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tbl", scope: !607, file: !606, line: 938, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UT_hash_table", file: !606, line: 904, size: 512, elements: !612)
!612 = !{!613, !622, !623, !624, !625, !626, !629, !630, !631, !632, !633}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !611, file: !606, line: 905, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "UT_hash_bucket", file: !606, line: 898, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UT_hash_bucket", file: !606, line: 880, size: 128, elements: !617)
!617 = !{!618, !620, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hh_head", scope: !616, file: !606, line: 881, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !616, file: !606, line: 882, baseType: !252, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "expand_mult", scope: !616, file: !606, line: 896, baseType: !252, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !611, file: !606, line: 906, baseType: !252, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "log2_num_buckets", scope: !611, file: !606, line: 906, baseType: !252, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "num_items", scope: !611, file: !606, line: 907, baseType: !252, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !611, file: !606, line: 908, baseType: !619, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hho", scope: !611, file: !606, line: 909, baseType: !627, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !628, line: 51, baseType: !172)
!628 = !DIFile(filename: "/usr/lib/llvm-6.0/lib/clang/6.0.0/include/stddef.h", directory: "/home/tren/Documents/Aloja/evaluation/DY_1_mosquitto/mosquitto/src")
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ideal_chain_maxlen", scope: !611, file: !606, line: 913, baseType: !252, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nonideal_items", scope: !611, file: !606, line: 918, baseType: !252, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ineff_expands", scope: !611, file: !606, line: 926, baseType: !252, size: 32, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "noexpand", scope: !611, file: !606, line: 926, baseType: !252, size: 32, offset: 416)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !611, file: !606, line: 928, baseType: !250, size: 32, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !607, file: !606, line: 939, baseType: !135, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !607, file: !606, line: 940, baseType: !135, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "hh_prev", scope: !607, file: !606, line: 941, baseType: !619, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "hh_next", scope: !607, file: !606, line: 942, baseType: !619, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !607, file: !606, line: 943, baseType: !135, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !607, file: !606, line: 944, baseType: !252, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hashv", scope: !607, file: !606, line: 945, baseType: !252, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "psk_id", scope: !414, file: !49, line: 270, baseType: !599, size: 64, offset: 1216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dest_ids", scope: !401, file: !49, line: 367, baseType: !643, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dest_id_count", scope: !401, file: !49, line: 368, baseType: !146, size: 32, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !401, file: !49, line: 369, baseType: !146, size: 32, offset: 480)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !401, file: !49, line: 370, baseType: !225, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !401, file: !49, line: 371, baseType: !273, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !401, file: !49, line: 372, baseType: !649, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto__payload_uhpa", file: !49, line: 125, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !49, line: 122, size: 64, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !650, file: !49, line: 123, baseType: !135, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !650, file: !49, line: 124, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 8)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "message_expiry_time", scope: !401, file: !49, line: 373, baseType: !168, size: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !401, file: !49, line: 374, baseType: !250, size: 32, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "source_mid", scope: !401, file: !49, line: 375, baseType: !230, size: 16, offset: 800)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !401, file: !49, line: 376, baseType: !230, size: 16, offset: 816)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !401, file: !49, line: 377, baseType: !244, size: 8, offset: 832)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !401, file: !49, line: 378, baseType: !298, size: 8, offset: 840)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !401, file: !49, line: 379, baseType: !244, size: 8, offset: 848)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !395, file: !49, line: 386, baseType: !273, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !395, file: !49, line: 387, baseType: !168, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !395, file: !49, line: 388, baseType: !230, size: 16, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !395, file: !49, line: 389, baseType: !244, size: 8, offset: 336)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !395, file: !49, line: 390, baseType: !298, size: 8, offset: 344)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !395, file: !49, line: 391, baseType: !66, size: 32, offset: 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !395, file: !49, line: 392, baseType: !34, size: 32, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !395, file: !49, line: 393, baseType: !298, size: 8, offset: 416)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "queued", scope: !391, file: !4, line: 191, baseType: !394, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "msg_bytes", scope: !391, file: !4, line: 192, baseType: !409, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "msg_bytes12", scope: !391, file: !4, line: 193, baseType: !409, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count", scope: !391, file: !4, line: 194, baseType: !146, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count12", scope: !391, file: !4, line: 195, baseType: !146, size: 32, offset: 288)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_quota", scope: !391, file: !4, line: 203, baseType: !146, size: 32, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_maximum", scope: !391, file: !4, line: 204, baseType: !230, size: 16, offset: 352)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_out", scope: !219, file: !4, line: 278, baseType: !391, size: 384, offset: 2048)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "acl_list", scope: !219, file: !4, line: 279, baseType: !435, size: 64, offset: 2432)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !219, file: !4, line: 280, baseType: !413, size: 64, offset: 2496)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet_last", scope: !219, file: !4, line: 281, baseType: !248, size: 64, offset: 2560)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !219, file: !4, line: 282, baseType: !684, size: 64, offset: 2624)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subhier", file: !49, line: 343, size: 896, elements: !687)
!687 = !{!688, !689, !690, !691, !702, !709, !710, !711}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !686, file: !49, line: 344, baseType: !605, size: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !686, file: !49, line: 345, baseType: !685, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !686, file: !49, line: 346, baseType: !685, size: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !686, file: !49, line: 347, baseType: !692, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subleaf", file: !49, line: 320, size: 256, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !693, file: !49, line: 321, baseType: !692, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !49, line: 322, baseType: !692, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !693, file: !49, line: 323, baseType: !218, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !693, file: !49, line: 324, baseType: !250, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !693, file: !49, line: 325, baseType: !244, size: 8, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "no_local", scope: !693, file: !49, line: 326, baseType: !298, size: 8, offset: 232)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "retain_as_published", scope: !693, file: !49, line: 327, baseType: !298, size: 8, offset: 240)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !686, file: !49, line: 348, baseType: !703, size: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subshared", file: !49, line: 337, size: 576, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "hh", scope: !704, file: !49, line: 338, baseType: !605, size: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !49, line: 339, baseType: !225, size: 64, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !704, file: !49, line: 340, baseType: !692, size: 64, offset: 512)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "retained", scope: !686, file: !49, line: 349, baseType: !400, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !686, file: !49, line: 350, baseType: !225, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "topic_len", scope: !686, file: !49, line: 351, baseType: !230, size: 16, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "shared_subs", scope: !219, file: !4, line: 283, baseType: !713, size: 64, offset: 2688)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__subshared_ref", file: !49, line: 331, size: 128, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "hier", scope: !715, file: !49, line: 332, baseType: !685, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !715, file: !49, line: 333, baseType: !703, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "auth_method", scope: !219, file: !4, line: 284, baseType: !225, size: 64, offset: 2752)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sub_count", scope: !219, file: !4, line: 285, baseType: !146, size: 32, offset: 2816)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "shared_sub_count", scope: !219, file: !4, line: 286, baseType: !146, size: 32, offset: 2848)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pollfd_index", scope: !219, file: !4, line: 287, baseType: !146, size: 32, offset: 2880)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ws_want_write", scope: !219, file: !4, line: 296, baseType: !298, size: 8, offset: 2912)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "assigned_id", scope: !219, file: !4, line: 297, baseType: !298, size: 8, offset: 2920)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_qos", scope: !219, file: !4, line: 337, baseType: !244, size: 8, offset: 2928)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "hh_id", scope: !219, file: !4, line: 340, baseType: !605, size: 448, offset: 2944)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "hh_sock", scope: !219, file: !4, line: 341, baseType: !605, size: 448, offset: 3392)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "for_free_next", scope: !219, file: !4, line: 342, baseType: !218, size: 64, offset: 3840)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_list_item", scope: !219, file: !4, line: 343, baseType: !730, size: 64, offset: 3904)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "session_expiry_list", file: !4, line: 144, size: 192, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !731, file: !4, line: 145, baseType: !218, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !731, file: !4, line: 146, baseType: !730, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !4, line: 147, baseType: !730, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !219, file: !4, line: 348, baseType: !146, size: 32, offset: 3968)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!739 = !DILocalVariable(name: "mosq", arg: 1, scope: !215, file: !1, line: 61, type: !218)
!740 = !DILocation(line: 61, column: 37, scope: !215)
!741 = !DILocalVariable(name: "keepalive", arg: 2, scope: !215, file: !1, line: 61, type: !230)
!742 = !DILocation(line: 61, column: 52, scope: !215)
!743 = !DILocalVariable(name: "clean_session", arg: 3, scope: !215, file: !1, line: 61, type: !298)
!744 = !DILocation(line: 61, column: 68, scope: !215)
!745 = !DILocalVariable(name: "properties", arg: 4, scope: !215, file: !1, line: 61, type: !737)
!746 = !DILocation(line: 61, column: 109, scope: !215)
!747 = !DILocalVariable(name: "packet", scope: !215, file: !1, line: 64, type: !248)
!748 = !DILocation(line: 64, column: 28, scope: !215)
!749 = !DILocalVariable(name: "payloadlen", scope: !215, file: !1, line: 65, type: !146)
!750 = !DILocation(line: 65, column: 6, scope: !215)
!751 = !DILocalVariable(name: "will", scope: !215, file: !1, line: 66, type: !244)
!752 = !DILocation(line: 66, column: 10, scope: !215)
!753 = !DILocalVariable(name: "byte", scope: !215, file: !1, line: 67, type: !244)
!754 = !DILocation(line: 67, column: 10, scope: !215)
!755 = !DILocalVariable(name: "rc", scope: !215, file: !1, line: 68, type: !146)
!756 = !DILocation(line: 68, column: 6, scope: !215)
!757 = !DILocalVariable(name: "version", scope: !215, file: !1, line: 69, type: !244)
!758 = !DILocation(line: 69, column: 10, scope: !215)
!759 = !DILocalVariable(name: "clientid", scope: !215, file: !1, line: 70, type: !225)
!760 = !DILocation(line: 70, column: 8, scope: !215)
!761 = !DILocalVariable(name: "username", scope: !215, file: !1, line: 70, type: !225)
!762 = !DILocation(line: 70, column: 19, scope: !215)
!763 = !DILocalVariable(name: "password", scope: !215, file: !1, line: 70, type: !225)
!764 = !DILocation(line: 70, column: 30, scope: !215)
!765 = !DILocalVariable(name: "headerlen", scope: !215, file: !1, line: 71, type: !146)
!766 = !DILocation(line: 71, column: 6, scope: !215)
!767 = !DILocalVariable(name: "proplen", scope: !215, file: !1, line: 72, type: !146)
!768 = !DILocation(line: 72, column: 6, scope: !215)
!769 = !DILocalVariable(name: "will_proplen", scope: !215, file: !1, line: 72, type: !146)
!770 = !DILocation(line: 72, column: 19, scope: !215)
!771 = !DILocalVariable(name: "varbytes", scope: !215, file: !1, line: 72, type: !146)
!772 = !DILocation(line: 72, column: 33, scope: !215)
!773 = !DILocalVariable(name: "local_props", scope: !215, file: !1, line: 73, type: !273)
!774 = !DILocation(line: 73, column: 22, scope: !215)
!775 = !DILocalVariable(name: "receive_maximum", scope: !215, file: !1, line: 74, type: !230)
!776 = !DILocation(line: 74, column: 11, scope: !215)
!777 = !DILocation(line: 76, column: 2, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !1, line: 76, column: 2)
!779 = distinct !DILexicalBlock(scope: !215, file: !1, line: 76, column: 2)
!780 = !DILocation(line: 76, column: 2, scope: !779)
!781 = !DILocation(line: 78, column: 5, scope: !782)
!782 = distinct !DILexicalBlock(scope: !215, file: !1, line: 78, column: 5)
!783 = !DILocation(line: 78, column: 11, scope: !782)
!784 = !DILocation(line: 78, column: 20, scope: !782)
!785 = !DILocation(line: 78, column: 37, scope: !782)
!786 = !DILocation(line: 78, column: 41, scope: !782)
!787 = !DILocation(line: 78, column: 47, scope: !782)
!788 = !DILocation(line: 78, column: 5, scope: !215)
!789 = !DILocation(line: 78, column: 51, scope: !782)
!790 = !DILocation(line: 91, column: 13, scope: !215)
!791 = !DILocation(line: 91, column: 19, scope: !215)
!792 = !DILocation(line: 91, column: 11, scope: !215)
!793 = !DILocation(line: 92, column: 13, scope: !215)
!794 = !DILocation(line: 92, column: 19, scope: !215)
